{
  "submissions": [
    {
      "course_id": "CS191",
      "description": "I have built NLP models that read a teacher’s transcript and highlight five different teaching strategies. We provide Section Leaders in Code in Place with weekly feedback based on these talk moves by pulling their transcript from the zoom API, running it through the models, and then displaying it within an intuitive UI. To develop the models, I explored both Roberta and GPT, using different hyperparameters based on how the talk moves are often employed. Using these models on last year’s Code in Place data, we find that teachers who use more talk moves increase student outcomes, such as having higher section attendance. We are currently running a study on the effect of choice on teacher development, and hypothesize that if teachers choose which of the five talk moves to receive feedback on each week, they will internalize the feedback more.",
      "project_name": "Code in Place Teacher Feedback",
      "team_members": "Ashlee Kupor",
      "placement": ["All", "Education", "Social"]
    },
    {
      "course_id": "CS191",
      "description": "This project begins the development of a pipeline from medical image data to patient-specific cardiac simulation. Congenital heart disease varies greatly between patients, so being able to visualize a patient’s unique anatomy and approximate their hemodynamics can be valuable for the planning of surgical repairs. This project explores the use of a 3D-0D coupled model to accomplish this, looking at the process of making a patient-specific 3D model of the heart, as well as how to tune a 0D model to fit patient hemodynamic data. The aim is to continue working on this project, so that the pipeline becomes more streamlined and efficient. Then we hope to edit these models and simulate surgical results to further aid in planning and treatment.",
      "project_name": "Developing a Pipeline for Patient-Specific Models of Congenital Heart Disease",
      "team_members": "Kaitlin Harold",
      "placement": ["All", "Healthcare"]
    },
    {
      "course_id": "CS191",
      "description": "Code in Place is a free, human-centric online offering of the first half of Stanford’s CS106A (Python programming) to beginner coders all over the world. Code in Place 2023 has over 8000 students and over 500 volunteer section leaders. \nThe Stories page aims to enable members of the large Code in Place community to feel inspired by each others’ pathways through CS, empower beginners to see a path forward in CS for themselves after the course ends, and serve as a sort of gallery of all of the lovely people from all walks of life who have come together to learn and teach computer science in Code in Place.",
      "project_name": "Code in Place Stories",
      "team_members": "Miranda Li",
      "placement": ["All", "Education", "Social"]
    },
    {
      "course_id": "CS191",
      "description": "Bytes is a revolutionary social media platform that empowers users to amplify their authenticity. As TikTok sounds and podcasts continue to gain popularity in today's digital landscape, Bytes takes social sharing to the next level. Each day, users are presented with a thought-provoking question, designed to inspire reflection and meaningful conversation. Prompts like “What is something you learned this week?” open the floor for users to record their thoughts, experiences, and emotions as a shareable audio byte. Bytes gives users until 5pm to record their daily audio updates, after which a unique \"podcast\" is generated, combining the audio bytes of everyone a user follows. Come see what we’ve been working on and unleash your voice in a community that values genuine connections. Amplify your authenticity and experience the power of audio-based social sharing with Bytes.",
      "project_name": "Bytes",
      "team_members": "Liam Smith, Jewel Matanane",
      "placement": [
        "All",
        "Behavior Change and Wellness",
        "Personal Productivity",
        "Productivity",
        "Social Media"
      ]
    },
    {
      "course_id": "CS191",
      "description": "The goal of this project is to protect users, organizations, and certificate authorities (CAs) against DNS hijacking incidents by building and deploying a global monitoring system to collect domain-related data immediately following certificate issuance. This first phase involves building data collection infrastructure to collect live data that can be analyzed to enable immediate mitigation of hijacking efforts. ",
      "project_name": "Infrastructure for Real Time Identification of Targeted DNS Infrastructure Hijacking",
      "team_members": "Jessica Yu",
      "placement": ["All", "Security"]
    },
    {
      "course_id": "CS191",
      "description": "The Sentinel Project aims to protect users, organizations, and certificate authorities (CAs) against DNS hijacking incidents by building and deploying a global monitoring system to collect domain-related data immediately following certificate issuance. ",
      "project_name": "Sentinel",
      "team_members": "Nathan Bhak, Jessica Yu",
      "placement": ["All", "Security"]
    },
    {
      "course_id": "CS191",
      "description": "Chest X-rays (CXRs) are a rich source of information for physicians – essential for disease diagnosis and treatment selection. Recent deep learning models aim to alleviate strain on medical resources and improve patient care by automating the detection of diseases from CXRs. However, shortages of labeled CXRs can pose a serious challenge when training models. Currently, models are generally pretrained on ImageNet, but they often need to then be finetuned on hundreds of thousands of labeled CXRs to achieve high performance. Therefore, the current approach to model development is not viable on tasks with only a small amount of labeled data. An emerging method for reducing reliance on large amounts of labeled data is self-supervised learning (SSL), which uses unlabeled CXR datasets to automatically learn features that can be leveraged for downstream interpretation tasks. In this work, we investigated whether self-supervised pretraining methods could outperform traditional ImageNet pretraining for chest X-ray interpretation. We found that SSL-pretrained models outperformed ImageNet-pretrained models on thirteen different datasets representing high diversity in geographies, clinical settings, and prediction tasks. We thus show that SSL on unlabeled CXR data is a promising pretraining approach for a wide variety of CXR interpretation tasks, enabling a shift away from costly labeled datasets.",
      "project_name": "cxrlearn",
      "team_members": "Niveditha Iyer",
      "placement": ["All", "Healthcare", "AI"]
    },
    {
      "course_id": "CS191",
      "description": "Hop is a new transport and remote access protocol with an emphasis on simplicity and security. It aims to be a replacement for SSH with secure identity forwarding and IP roaming while having a significantly smaller code base. The Hop transport layer is uses a Cyclist duplex construction with a Noise handshake pattern to establish a secure connection between endpoints. ",
      "project_name": "Hop: A Modern Transport and Remote Access Protocol",
      "team_members": "George Hosono",
      "placement": ["All", "Security"]
    },
    {
      "course_id": "CS191",
      "description": "The Domain Name System (DNS) is an internet-wide distributed database with a hierarchical namespace. One consequence of the hierarchical namespace is that various parties involved in the authoritative side of DNS resolution must implicitly or explicitly trust one another. Additionally, DNS allows for explicit trust between different domain names, allowing delegation of nameservice to a nameserver under a different domain. This trust when violated results in major security issues. As such, the trust graph for a domain (all of the other domains explicitly and implicitly trusted by it) represents its potential attack surface; a compromise of any domain in the trust graph leads to the compromise of the target domain. In this project, we build a tool to efficiently build these DNS trust closures and tools to visualize them. We study the trust closures for .gov zones and identify any vulnerabilities in the trust closures that present an avenue for hijacking resolution.",
      "project_name": "DNS Trawler",
      "team_members": "Rishi Sreekanth",
      "placement": ["All", "Security"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Our project is a web application which is oriented toward the optimization of subscription services based on a user's interests and budget. Every year, countless companies shift their business models from single time pay to recurring payment services which forces users to make tough decisions on which services to use, for how long, and for what price.\n\nWe, the StreamLine team, have created a platform which takes in a user's desired viewing content and recommends the optimal combination of streaming packages to purchase which get the most out of your subscriptions. Our optimizations will be based on user specified budgets, optional must-have subscriptions, as well as user inputted viewing preferences which can range from specific shows and/or movies to a broader genre of interest. We will then report their varying options which provide them the most relatable content in a budget friendly manner.",
      "project_name": "StreamLine",
      "team_members": "Ryan Dunn, Eliot Jones, Josh Karty, Josh Francis",
      "placement": ["All", "Finance", "Behavior Change and Wellness"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Spenny aims to provide a one-stop shop for optimizing credit card rewards. It uses AI-driven algorithms to analyze users' spending habits and financial preferences, providing them with customized credit card recommendations that suit their needs and lifestyles. Spenny wraps this all up in a user-friendly platform with the potential to expand into other areas of personal finance, budgeting, and payments. ",
      "project_name": "Spenny",
      "team_members": "Henry Bradley, Sebastian Campos, Krain Chen, Caroline Tran, Tristan Wang\t",
      "placement": ["All", "Finance", "Productivity", "Personal Productivity"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Our goal is to create a searchable database for clothing. Gathering clothing from a variety of sources, we hope to create a website in which users can search with many filtering options for clothing themes, brands, or styles and be able to see the clothing that fits those parameters and links to purchase the clothing. The search engine is powered by a computer vision model to provide enhanced search results and semantic parsing!",
      "project_name": "FitFinder",
      "team_members": "Derek Askaryar, Sofiane Larbi, Sungbin Kim, Anthony Radke",
      "placement": ["All", "Commerce", "AI"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Keep track of the jobs you’ve applied to with our chrome extension! With just one click, you can save the jobs you’re interested in and view them conveniently. See upcoming deadlines, recently added, and your most interested jobs all in one place.",
      "project_name": "BeeThirteen",
      "team_members": "Raymond Suo, Romeo Umana, Hannah Santos, Felipe Calero Forero, Lainey Wang",
      "placement": ["All", "Productivity", "Personal Productivity"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Digital communication has solidified into three forms: instant messaging, e-mail, and social media. What if we go beyond these three styles of communication? Our objective is to create a new paradigm to expand the ways we connect with each other online. Coexist is a web messaging application wherein messages are aggregated and sent at a scheduled time in order to reduce digital anxiety and encourage slower, deeper and more detailed conversations.",
      "project_name": "Coexist",
      "team_members": "Katherine Ho, Penny Shi, Jared Azevedo, Alexis Echano, Srijon Sheikh",
      "placement": ["All", "Social Media", "Behavior Change and Wellness"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": " \"Tab Defenders is a Google Chrome extension that aims to reduce the background activity created from unused tabs. We aim to do this by closing tabs for the user after a specified amount of inactivity. Our extension is smart enough to learn domain-specific usage patterns for every user, ensuring a highly personalized experience. With fewer open tabs, users can reclaim RAM while having a cleaner browsing experience!”",
      "project_name": "Tab Defenders",
      "team_members": "William Lam, Aman Ladia, Jean Lagurre, Anthony Mensah, Manh Hung Bui",
      "placement": ["All", "Productivity", "Personal Productivity"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Engage in corporate espionage in a dark sci-fi setting while interacting with NPCs using natural language",
      "project_name": "Forever 22",
      "team_members": "Shimea Bridgewater, Bay Foley-Cox, Julia Rose Chin",
      "placement": ["All", "Games", "AI"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Splitting the bill can be confusing and time-consuming, but SplitIt can relieve all of that stress. SplitIt is an app that can take a picture of the receipt and recognize all of the different items, including tax and tip. You can then assign different items to different people to split the bill and it can keep a history log of all previous receipts and transactions you split with others. It will automatically tally up how much others owe you and how much you owe your friends, making the entire process fair and efficient!",
      "project_name": "SplitIt",
      "team_members": "Trevor Leon, Britney Tran, Mark Tran, Raul Alcantar",
      "placement": ["All", "Finance", "Social"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "We’re building CuteQueue, an office hours queue platform with the primary goal of integrating the queue into the student’s learning experience. Our focus is on scaffolding requests, improving communication between staff and students, and enhancing visual design —before, during, and after being helped—all to improve student self-efficacy.",
      "project_name": "CuteQueue",
      "team_members": "Daniel Chao, Star Doby, Nadin Tamer, Trevor Carrell",
      "placement": ["All", "Education", "Productivity"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Finding your favorite restaurants and planning dinners with friends all in one. Collaboratively search for a restaurant with all of your friends' preferences and dietary restrictions accounted for, save your favorite places, and prepare your tastebuds to be happy.",
      "project_name": "Popina",
      "team_members": "Sreya Halder, Sophia Fay, Sean Oconnor, Maya Madere",
      "placement": ["All", "Social", "Commerce"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Playmakers is a mobile app designed to promote physical and social activity among the Stanford community. Our objective is to make it easy for users to find others with similar interests and participate in a wide variety of sports and activities. With features such as public and private event scheduling, a map showcasing events and filters based on interests, and the ability to add friends and message them, Playmakers helps users build a community of like-minded individuals and lead active lifestyles.",
      "project_name": "Playmakers",
      "team_members": "David Gonzalez, Gerzain Gutierrez, Karson Lippert, Josue Solano-Romero",
      "placement": ["All", "Social", "Productivity"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Single Seagull Simulator is a voice-controlled indie-style PC game that gives you an insight into the struggles of a seagull. Every day, you (a seagull) hunt for human food. Through each fight, you demonstrate the two core tenets of being a seagull: to intimidate and to overpower. One day, you adopt an egg. It eats your food. It eats your food?!?? Will your love and care help it develop into a healthy young seagull, or…?",
      "project_name": "Conjoined Meercats",
      "team_members": "Christina Qin, Julia Park, Megan Liu, Melissa Ran",
      "placement": ["All", "Games"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Photo Wars is a web platform for user-submitted and user-voted photo humor, inspired by the popular subreddit r/photoshopbattles. Photo Wars provides a centralized and streamlined interface for interacting with, sharing, and supporting photo comedy by allowing users to create and compete in a “photo war”, a low-stakes competition that has one user submitting an image for others to caption and submit photoshopped versions of the original. Submissions are immediately viewable by all users to be voted or commented on, and creators can gain points based on how well their submissions fare, creating a fun community based on hilarious visual gags.",
      "project_name": "Photo Wars",
      "team_members": "Ibrahim Dharhan, Jackie Gong, Jakob Nordhagen, Caroline Wang, Grace Zhou",
      "placement": ["All", "Social Media", "Games"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Syne is a mobile application to aid users in their adherence to repeated medication prescriptions. Users can upload their current prescriptions, and Syne will (1) provide active and continuous reminders for users to take medication as prescribed, and (2) optionally support adherence monitoring by a trusted caretaker to increase user accountability.",
      "project_name": "Syne",
      "team_members": "Meg Reinstra, Christine Manegan, Elisse Chow, Alice Zhang",
      "placement": ["All", "Healthcare"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Focus combines AI with your daily calendar to take the hassle out of creating, managing, and following your schedule. Our app will allow users to enter their list of tasks for the day, which it will use to generate a to-do list, and find the best times in the users' schedule to integrate the todo tasks.",
      "project_name": "23",
      "team_members": "WenXin Dong, Brendan Sorrell, Zachary Martin, King Vanga",
      "placement": ["All", "Productivity", "Personal Productivity", "AI"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Want to know the stats for all the current NBA games? Have an NBA-related question? Want to know some fun facts about the players and teams playing? For all of these questions and more, consult your new basketball best friend! Pull up our website while watching the game and gain intricate knowledge about the games and NBA in general. Our features include fun fact generation, NBA GPT, real-time stats, score updates, and game scores. We are excited to show you our product!",
      "project_name": "Soma Ventures",
      "team_members": "Josh Singh, Mohamed Osman, Jesus Meza, Ammar Alinur ",
      "placement": ["All", "Social", "AI"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "RoastMyResu.me is a web-based application that aims to provide job seekers with personalized feedback on the quality of their resumes. The platform utilizes large language models (LLMs) fine-tuned on recruiter-vetted resumes to provide an assessment that is both amusing and informative. ",
      "project_name": "RoastMyResume",
      "team_members": "Olivia Otto, Ethan Horoschak, Michael Yan, Daisuke Masuda",
      "placement": ["All", "Productivity", "Personal Productivity", "AI"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "YESA is a iOS based application that aims to provide informed eating by allowing users to take photos of their food and automatically display nutritional information for that given meal. YESA will automatically identify foods present in the user's meal and allow user input to adjust or edit the foods specified. Through YESA, the app hopes to streamline user's eating experiences by creating an automatic, snap-and-go experience with mindful, healthy encouragement. ",
      "project_name": "YESA: Plates for a Better You",
      "team_members": "Steven Li, Elizabeth Nguyen, Arnav Krishnamoorthi, Yara Sevilla",
      "placement": ["All", "Behavior Change and Wellness", "Healthcare"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Focus is an innovative web application that intelligently integrates AI with your daily calendar and to-do list to create a customized weekly schedule for you. After you enter a list of tasks that you need to finish, Focus will use that information combined with the events from your calendar to employ advanced AI algorithms which will create a personalized plan for you by weaving these tasks seamlessly into your weekly schedule.\n\nIt is more than a simple to-do list application or schedule manager--it's an innovative tool which is designed to optimize your time, multiply your productivity, and streamline your life. \n\nAsk our team about how you can use Focus to revolutionize your productivity today!",
      "project_name": "Focus",
      "team_members": "WenXin Dong, Zach Martin, Brendon Sorrell, King Vanga",
      "placement": ["All", "Behavior Change and Wellness", "AI"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Millions of people interact with a keyboard everyday. However, if you go out and buy an expensive new (likely mechanical) keyboard, you will find that not only can you NOT add additional key-layers, but you can actually only really customize a few keys (4-6 usually). Our goal is for an 'average' user to be able to setup new key-map layers on the keyboard with our GUI tool, and have it flashed to the keyboard from the GUI as well.",
      "project_name": "ONIT",
      "team_members": "Ismael Isidro Castro, Noel_Martinez-Amador, Olayinka Adekola, Tristen Nollman",
      "placement": ["All", "Productivity", "Personal Productivity"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Skillbites is an educational content platform where content creators make interactive courses with short-form videos and questions. The platform is designed to provide an entertaining way for people of all ages to engage with educational material ranging from science to street smarts.",
      "project_name": "Skillbites",
      "team_members": "Anthony Riley, Sohi Gatiganti, Grant Park, Carson Fleming",
      "placement": ["All", "Education", "Social Media"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "Squadify: a social network to find friends in your courses.",
      "project_name": "MiNKKs",
      "team_members": "Neil Khemani, Katherine Crandell, Michelle Karlsberg, Kayla Monae Kelly",
      "placement": ["All", "Social Media", "Education"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "BananAI is a fun tool for DJs and musicians to use in their live shows to create AI-generated visuals that sync to their music. The visuals can be “played” using a DJ or other MIDI board, creating an engaging and unique experience for the performer and the audience.",
      "project_name": "BananAI",
      "team_members": "Elliot Dauber, Matt Reed, James Chao, Isaac Cheriyuot",
      "placement": ["All", "Social", "AI"]
    },
    {
      "course_id": "CS210",
      "description": "Your Edventure begins now. Imagine a future in which you could instantly teleport from your dorm room in California to the sandstone steps of the ancient temple of Petra in Jordan. After exploring the dusty cavernous rooms of the building carved into the stone as early as 5th century BCE, you decide to teleport again: this time to the ancient city of Bagan in Myanmar. Creating this future was the driving vision of the Global Historical Archive (GHA) team at Meta, through the use of virtual reality. However, this future is limited to the few who have access to VR technology. Our project at Edventure hopes to help make this future more accessible to all through making a companion web experience to GHA's VR experience, trying to capture the  majesty and social experience of exploring these wonders with fellow explorers. ",
      "project_name": "Edventure",
      "team_members": "Devorah Rena Simon, Manas Khadka, Jiayi Li, Cristobal Garcia, Pratyush Muthukumar",
      "placement": ["All", "Education", "Social"]
    },
    {
      "course_id": "CS210",
      "description": "Brainwave is a cutting-edge product that takes the hassle out of taking meeting notes. With its live transcription feature, it automatically transcribes everything that's being said during a meeting, regardless of the platform being used, including Zoom, Microsoft Teams, and FaceTime. This ensures that you never miss an important detail again. Additionally, Brainwave's AI can assist you in answering questions about your meeting and bring up relevant topics to ensure that your meetings are always productive and efficient. With Brainwave, you can focus on the meeting at hand and leave the details to AI.",
      "project_name": "BrainWave",
      "team_members": "Alex Loia, Evan Saracay, Stephan Sharkov, Vy Thai",
      "placement": ["All", "Productivity", "Business/Office", "AI"]
    },
    {
      "course_id": "CS210",
      "description": "We're Benz Lenz and we're creating a social app to help connect people and places via voice memos (and more to come!). We're partnered with Mercedes and we developed a cool project using AR glasses during winter quarter, which we have since pivoted from. Come by to see our demo and we'll tell you more about what we're doing and why!",
      "project_name": "Benz Lenz",
      "team_members": "Ziyad Gawish, Alanna Sun, Nick Hafer, Danny Estupinan, Sophia Ramsey",
      "placement": ["All", "Automotive", "AR/VR", "Social"]
    },
    {
      "course_id": "CS210",
      "description": "Verve is a VS Code extension that provides developers with live debugging suggestions in a side panel. As you write code, Verve detects error diagnostics provided by external language servers and runtime errors in program output. Then, Verve searches the Internet for prospective solutions. Verve commonly finds links to Stack Overflow pages, and also pulls from students' online Ed forums. With the click of a button, developers can open the suggested resources in their browser, or ask Verve to generate a summary. Install Verve on the VS Code Marketplace today!",
      "project_name": "Team Verve ",
      "team_members": "Tiffany Zhao, Avi Gupta, Ryan Dwyer, Colin Schultz",
      "placement": ["All", "Education", "Social"]
    },
    {
      "course_id": "CS210",
      "description": "In the $150B revenue cycle management space where providers aim to maximize their revenue from treatment provided, medical coding has been especially tedious. The process involves manually translating patient health information & medical procedures into universal codes for billing and record-keeping purposes, and is troubled by 89% error rates, costing providers $17-29B yearly. The problem is also getting worse -- we have an aging global population, a change in standard from ICD-9 to 10 that increases complexity, and 30% coder labor shortages. Moreover, patients often bear the brunt of these coding errors, leading to surprise bills and a lack of trust. \n\nWe are Rema, an automated medical coding platform that uses Azure's HIPAA-compliant GPT-4 endpoint and integrates with existing electronic health record systems to handle ICD-10 coding. We’re positioned to provide a timely, efficient, and cost-effective solution, transforming revenue cycle management and improving patient care.",
      "project_name": "Rema",
      "team_members": "Roshan Swaroop, Ally Nakamura, Kachachan Em Chotitamnavee",
      "placement": ["All", "Healthcare", "AI"]
    },
    {
      "course_id": "CS210",
      "description": "The BenzBeyond team embarked on an ambitious journey to create a breakthrough AR Navigation application. The project's goal was to redefine navigation experiences through the lens of Augmented Reality technology, creating a more interactive and engaging environment for users. Rooted in the principles of user-centered design, we brainstormed, researched, and iterated on our designs, ensuring that our app genuinely addressed real-world user needs. We faced several challenges, including GPS accuracy issues and the intricate complexities of integrating different software platforms. But we overcame these hurdles, turning our envisioned concept into a tangible reality. Our end product is a user-friendly, intuitive, and efficient AR Navigation app, capable of guiding users from point A to point B with minimal distractions. As we reflect on our journey, we are excited about the insights gained, the skills honed, and the future possibilities in the realm of AR navigation.",
      "project_name": "BenzBeyond",
      "team_members": "Audrey Lee, Casey Nyguen, Ricky Thai, Yuer Zhou",
      "placement": ["All", "Automotive", "AR/VR"]
    },
    {
      "course_id": "CS210",
      "description": "MetaDrive, composed of Stanford students Rachel Clinton, Anais Marroquin, Mike Yang, and Eric Zhang, has partnered with BMW to reimagine the digital conferencing experience for drivers and passengers of vehicles. We utilize NReal AR glasses to enable users to participate in a safe and immersive digital meeting experience while on the road.\n\nOur meeting platform, which is designed in Unity, contains the following features: joining a virtual meeting, sharing screen, taking meeting notes using typing or voice recording, button clicking with hand gestures, and switching modes between the driver mode (a version with restricted functionality) and the passenger mode (the full version). \n\nWe are excited to share our work with you!",
      "project_name": "MetaDrive",
      "team_members": "Rachel Clinton, Anais Marroquin, Mike Yang, Eric Zhang",
      "placement": ["All", "Automotive", "Social", "AR/VR", "Productivity"]
    },
    {
      "course_id": "CS210",
      "description": "Build a browser extension in minutes.\nxTen is a package that enables developers to create cross-platform browser extensions powered by AI. The toolkit provides an extensible architecture for integrating AI APIs, simplifying the development process and offering advanced features such as intelligent web scraping, code + UI injection, and AI-powered data processing.",
      "project_name": "xTen",
      "team_members": "Ruslan Al-Jabari, Ashna Khetan, Ishita Mangla, Noel Sarduy",
      "placement": ["All", "AI", "Business/Office"]
    },
    {
      "course_id": "CS210",
      "description": "SOAR is an augmented reality (AR) navigation and social annotation app designed specifically for drivers. With its AR overlays, the app provides a hands-free navigation experience, allowing drivers to follow directions effortlessly while staying focused on the road. Additionally, SOAR enables users to explore and save points of interest (POIs) suggested by their friends, enhancing the social aspect of driving. Users can also contribute their own POIs, fostering a collaborative driving experience. Our prototypes have been developed on platforms such as Oculus in virtual reality (VR), NReal AR glasses, and Android for object detection. The primary goal of SOAR is to enhance driver comfort, entertainment, and safety, while promoting a connected driving community.",
      "project_name": "Team SOAR",
      "team_members": "Ali Shah, Anthony Qin, Benjamin Wittenbrink, Rohan Mehrotra, Sonny Young",
      "placement": ["All", "Automotive", "Social", "AR/VR"]
    },
    {
      "course_id": "CS210",
      "description": "Slingshot is a collaborative workflow management platform that leverages existing datasets to make a company's knowledge base accessible to all teams with granular control.\n\nWe are building a platform to allow researchers, engineers, analysts, and managers at all levels of an organisation to have their questions answered faster, using LLMs to tie these answers to their source-of-truth documents, and building their workflows right into our platform to create the rails for a company's collaborative efforts that are focused on innovating based on these documents.\n\nWe seek to produce exponential knowledge for our partners as the insights they generate using Slingshot will be accrued in the source-of-truth for future teams to benefit from and integrate into their workflows in our platform.",
      "project_name": "Slingshot",
      "team_members": "Flynn Traeger, Bryn Hughes, Moe Khalil, Porter Weisberg",
      "placement": ["All", "Productivity", "Business/Office", "AI"]
    },
    {
      "course_id": "CS191",
      "description": "charisma-as-a-service (CaaS) using generative AI and large language models.",
      "project_name": "rizzGPT",
      "team_members": "bryan chiang",
      "placement": ["All", "AI", "Social"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "PodGPT is an all-in-one chatbot to talk to documents, podcasts, videos, news articles, and websites",
      "project_name": "PodSquad",
      "team_members": "Abhay Singhal, Daniel Ma, Jack Yuan, Niral Patel",
      "placement": ["All", "Productivity", "Business/Office", "AI"]
    },
    {
      "course_id": "CS191",
      "description": "Recognizing human activities has recently been a central focus in video understanding for different applications. Specifically for assistive robots, smart homes, or healthcare applications, understanding activities of daily living (ADLs) is an integral component. However, to date, few benchmarks and methods have focused on complex ADLs, especially those involving multi-person interactions. We propose a new dataset and benchmark called InteractAD for understanding complex ADLs that involve interaction between humans (and objects). Our multi-modal (11 modalities) and multi-view (ego and multiple third-person views) dataset is annotated with human-human interactions, beyond human-object relationships considered by the prior work, as well as hierarchical activity labels for each individual in the scene.",
      "project_name": "InteractADL",
      "team_members": "Edward Vendrow",
      "placement": ["All", "AI", "AI Research"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "BeYoked is a social media and workout-tracking app which allows users to post photos of their workouts, track their fitness progress by creating personal goals, and connect with other people interested in fitness through the app's online community. ",
      "project_name": "BeYoked",
      "team_members": "AJ Arnolie, Ava Stills, Devin Green, Joseph Ngo, Lorenzo Ahn",
      "placement": ["All", "Social", "Behavior Change and Wellness"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "BunnyHabit is a community-driven habit tracking app where users and their friends can update each other on the progress of their individual and shared goals.",
      "project_name": "BunnyHabit",
      "team_members": "Eric Bear, Murtaza Hassan, Kyle Nguyen, Andre Saunders, Liz Sinyavin",
      "placement": ["All", "Behavior Change and Wellness", "Social"]
    },
    {
      "course_id": "CS191",
      "description": "Ensuring safety and human value alignment in foundation models (FMs) is increasingly important. Supervised Fine-Tuning (SFT) offers simplicity and robustness, while Reinforcement Learning from Human Feedback (RLHF) yields state-of-the-art results but suffers from instability and reward hacking. We propose Supervised Iterative Learning from Human Feedback (SuperHF), a method combining the best of both approaches. SuperHF focuses on the reward model's importance in RLHF for data efficiency and generalization while replacing Proximal Policy Optimization (PPO) with a simpler supervised loss and a KL divergence prior.\n\nWe split our evaluation criteria into robust optimization of the reward while also avoiding reward hacking. For the former, SuperHF beats other training methods on the reward objective. For the latter, we conduct qualitative ratings by GPT-4 to find SuperHF outperforms RLHF in terms of reward, stability, robustness across hyperparameters, and reducing reward hacking.",
      "project_name": "SuperHF: Supervised Iterative Learning from Human Feedback",
      "team_members": "Gabriel Mukobi",
      "placement": ["All", "AI", "AI Research"]
    },
    {
      "course_id": "CS194 or CS194W",
      "description": "After a long day, the last thing people want to do is stress over what to cook with the items in their fridge. There are other online tools that generate recipes from the ingredients you have, but they still make you manually check off everything in your fridge, which becomes a huge hassle.\n\nIntroducing Rizzcipe -- a mobile app that takes all the effort out of meal planning. Just snap a pic of your fridge, and bam! Rizzcipe knows what's in there and suggests recipes that fit the bill. It's like having a genius chef right in your pocket, powered by cutting edge machine learning technology.",
      "project_name": "Rizzcipe",
      "team_members": "Andrew Gan, Constance Horng, David Liu, Grace Zhang",
      "placement": [
        "All",
        "Productivity",
        "Personal Productivity",
        "Behavior Change and Wellness",
        "AI"
      ]
    },
    {
      "course_id": "CS191",
      "description": "Despite the wide availability of remote sensing imagery, deep learning continues to be bottle-necked in this space by the lack of labeled data. We explore using active learning to address this need, adapting modern active learning approaches to the structure of remote sensing data. First, we improve upon \"cold-start\" active learning, which assumes no initial label pool, by using SatMAE, a self-supervised vision transformer, with ProbCover, a state-of-the-art active learning algorithm. Next, we improve on \"warm-start\" active learning approaches, which require an initial label pool, by incorporating geographical information with the margin and entropy sampling techniques. For each domain, we achieve strong performance, demonstrating the use case of geospatial information with self-supervised active learning approaches for remote sensing tasks.",
      "project_name": "Improving Active Learning for Remote Sensing Datasets",
      "team_members": "Matthew Kolodner, Senem Isik, Amol Singh, Jake Silberg, Jeremy Irvin",
      "placement": ["All", "AI", "AI Research"]
    },
    {
      "course_id": "CS191",
      "description": "A Plot in the Dark is an online party game that tests how well you know your friends—and how well your friends know you! Our game supports up to four players and consists of three rounds. During each round, you will plot everyone (including yourself!) on a cartesian plane using a variety of wacky prompts to guide your placements. You can feel free to answer honestly as there are no winners or losers in this game, only data! Once all players’ placements are collected, you will get to see each player’s average placement, as well as where everyone individually placed them. After the three rounds, special titles are awarded based on each player's results and how their responses compare to the others’!",
      "project_name": "A Plot in the Dark",
      "team_members": "Miranda Diaz, Jasmine Steele, Ember Fu",
      "placement": ["All", "Games"]
    },
    {
      "course_id": "CS191",
      "description": "I'm passionate about building design, biophilic design, and discovering how humans can create better structures that exist in harmony with nature and contribute to the health of the surrounding environment while also promoting human wellbeing. As a CS major, I was also interested in developing practical CS skills that I hadn't explored yet, such as Google Cloud and Firebase, and further developing my existing skills, such as implementing APIs.\n\nConsequently, when I discovered the Hybrid Physical and Digital Spaces Lab (HDPS), their amazing work, and their need for developers to assist them in creating the technological infrastructure to prepare for their upcoming research study, I knew this would be a perfect fit. My independent research with HPDS gave me the opportunity to pursue my computer science and academic learning goals while learning more from the interdisciplinary HPDS Lab doing work I'm passionate about to improve the built environment.\n\nThe Hybrid Physical and Digital Spaces Lab (HDPS) is an interdisciplinary team collaborating to create new knowledge about how to build an environment for enhanced environmental sustainability and occupant wellbeing. The goal of the research lab is to collect insights and create references and tools for those involved with constructing the built environment so they can incorporate digital and physical adaptations that would enhance the environments they are creating. HPDS is conducting a research study soon and wants to automate the retrieval and analysis of fitbit data from study participants and indoor air quality environmental sensor data.\n\nInitially, my research mentors gave me the task of writing Cloud Functions to automate the data collection and some analysis processes from the fitbit and AWAIR environmental sensor APIs and ensure all this data was uploaded to the Firebase backend so they could analyze it for the research study or potentially use it to make the accompanying iOS app used in the research study \"smarter\". As I began learning more about Cloud Functions and the task at hand, I realized there were two prerequisite steps that needed to be taken: creating a script to onboard study participant's fitbit API access tokens to Firebase after they agreed to online consent form granting us access to their fitbit data, and a thoughtful Firebase structure design must be prepared so that there is an organized data hierarchy to begin appending data to.\n\nThis Spring, I created the technical infrastructure crucial to the successful implementation of the research study. This involved:\n        \nPart 1\ncreating a script to automatically upload required information from each user to the backend at the beginning of the study\n        \nPart 2\nrestructuring and organizing the existing Firebase\n        \nPart 3\nusing APIs and Google Cloud Functions to automate processes to retrieve fitbit data from study participants and environmental sensor data\ncreating automated data analysis algorithms to extract insights from this data\nstoring the output of the algorithms and the raw data collected in the Firebase backend.",
      "project_name": "Hybrid Physical and Digital Spaces Lab Data Collection & Data Analysis Backend Platform Development",
      "team_members": "Taylore Givens",
      "placement": ["All", "Behavior Change and Wellness"]
    },
    {
      "course_id": "CS191",
      "description": "Previous work by my research mentor established that using both normal and shear force for touch gesture classification on a robotic arm equipped with tactile sensors classifies touch gestures better than just using normal force. My task is to find the best model which uses both normal and shear force to classify touch gestures, and explore its interpretability.",
      "project_name": "Devansh Sharma",
      "team_members": "Devansh Sharma",
      "placement": ["All", "AI Research"]
    },
    {
      "course_id": "CS191",
      "description": "WC-VAE explores the use of a variational autoencoder for compressed representation and characterization of Escherichia Coli (E. Coli) whole-cell modeling simulation data.",
      "project_name": "WC-VAE",
      "team_members": "Kate Callon",
      "placement": ["All", "Healthcare"]
    }
  ]
}
