{
  "submissions": [
    {
      "description": "Let’s Ride is a rideshare platform for Stanford students to post and join carpools. Our goal is to increase accessibility and frequency of carpools within the Stanford community, thereby increasing the mobility of students to get off-campus in a more affordable and environmentally-friendly way.",
      "placement": [
        "Social"
      ],
      "project_name": "Let's Ride",
      "team_members": "Cathy Zhang, Kasey Luo, Julie Wang"
    },
    {
      "description": "The use of self-supervised learning (SSL) algorithms has been on the rise across the machine learning community. SSL helps models acquire useful information from unlabelled data and then use this information to perform downstream tasks. The common paradigm here is to ‘pretrain’ on a large general dataset and then ‘finetune’ on a more specialized, typically smaller dataset.\nThe Domain-Agnostic Benchmark for Self-Supervised Learning (DABS) was published in NeurIPS last year, and has served as a benchmark for self-supervised learning algorithms. Specifically, to perform well on DABS, an algorithm must be pretrained on six unlabeled datasets from different domains: natural images, text, speech recordings, medical imaging, multichannel sensor data and image-text pairs.\n(Tamkin et al.)\nThrough this Senior Project, I implemented a system for fast and large scale training of self-supervised learning algorithms with DABS. Specifically, I designed and wrote a JAX codebase for DABS — enabling us to run baseline algorithms on Google Cloud Tensor Processing Units, or TPUs, and have an order of magnitude faster training times.",
      "placement": [
        "Other"
      ],
      "project_name": "Domain-Agnostic Benchmark for Self-Supervised Learning - writing a JAX codebase",
      "team_members": "Shashank Rammoorthy"
    },
    {
      "description": "Nexus is a decentralized blockchain interoperability protocol designed for arbitrary cross-chain messaging",
      "placement": [
        "Blockchain"
      ],
      "project_name": "Nexus: Blockchain Interoperability",
      "team_members": "Daniel Marin"
    },
    {
      "description": "Research interest in Internet measurement has grown immensely since the development of zmap, a stateless Internet-scale port scanner. Similarly, the presence of TCP services running on unexpected (or un-assigned) ports indicates a “long tail” of services which often have a considerably weaker security posture. In this work, we develop a UDP fingerprinting module for zmap that allows researchers to determine the distribution of UDP services running on unexpected ports",
      "placement": [
        "Security"
      ],
      "project_name": "Fingerprinting Unexpected UDP Services",
      "team_members": "Luca Pistor, Nathan Bhak"
    },
    {
      "description": "Rekt Bear is Yahoo! Finance for the modern investor. We provide rankings of meme stocks, most shorted stocks, and stocks most active on Fidelity; we also track finance celebrities like Jim Cramer, Cathie Wood, and our wonderful elected officials who definitely don't use insider information. In addition, we provide traditional financial information (market movers, graphs, news, P/E ratio and other statistics, etc.).",
      "placement": [
        "Finance"
      ],
      "project_name": "Rekt Bear",
      "team_members": "Will Ellsworth"
    },
    {
      "description": "In many industry computer vision tasks, large, labeled datasets are hard to come by. Therefore, when it comes to training deep neural networks, they have a hard time learning meaningful representations from the dataset. One way to visualize these models is through calculation of \"attention maps\" that display which parts of the input were important in making the associated prediction. Attention maps can be calculated in different ways, and as a result, do not always agree with each other. This problem becomes exacerbated when the model is overfitting to a small dataset. As a result, the QIAI lab proposes an unsupervised learning objective to be used as a fine-tuning step, where we calculate attention maps with 2 different algorithms and enforce a similarity metric between them.",
      "placement": [
        "Other"
      ],
      "project_name": "Enforcing Attention Map Consistency for Unsupervised Finetuning",
      "team_members": "Max Pike"
    },
    {
      "description": "Our project aims to create a space where undergraduates can compare schedules and share courses they are currently and are planning on taking. We want to be the social middle ground between Explore Courses and Carta, allowing users to clearly visualize what their and their peers' schedules will look like.",
      "placement": [
        "Education",
        "Social",
        "Mobile"
      ],
      "project_name": "Classy",
      "team_members": "Grace Alwan, Dean Stratakos, Jiwon Lee, Melissa Daniels, Tara Jones"
    },
    {
      "description": "Implementing an NFT minter on the Chia blockchain.",
      "placement": [
        "Blockchain"
      ],
      "project_name": "NFTs on the Chia blockchain",
      "team_members": "Jennifer He, Ende Shen, Aaron Reed, Finn Dayton"
    },
    {
      "description": "DAHA is a mobile app that allows Stanford students to sell, rent, and buy goods on campus quickly and efficiently. Our product was inspired by DAHA requests in dorm chats, as well as the need for seniors to sell their belongings before graduating to underclassmen that wish to purchase common goods for their college experience at a cheaper price. We envision this as a marketplace for all Stanford students, which extends the reach of DAHA requests beyond a single dorm. In this marketplace, users can enter items that they are seeking (a DAHA request). All users will have access to the requests, allowing them to see which items are in demand. If they have something being requested and wish to sell it, they can create a DAWA post about their item and name their price. Even if a user doesn't wish to make a DAHA, they can enter the marketplace and see what items are up for sale. By understanding what items are in demand and being requested, we hope to encourage the recycling of goods at Stanford.",
      "placement": [
        "Mobile",
        "Commerce"
      ],
      "project_name": "DAHA?",
      "team_members": "Krishnan Nair, Stephanie Hu, Rick Robert, Derian Williams, Adonis Pugh"
    },
    {
      "description": "MethaneSAT is a satellite that will be launched in 2 years to track methane emissions from oil and gas facilities. However, we needed to build a dataset of the locations of the oil and gas facilities using satellite imagery.",
      "placement": [
        "Environment"
      ],
      "project_name": "Dataset for methane tracking",
      "team_members": "Erfan Rostami"
    },
    {
      "description": "The Honest Protocol is an ecosystem for decentralized audits of digital assets on Ethereum. It allows for a decentralized, validated database in which NFTs are labeled with honesty/anti-scam-related traits. This is necessary in a world in which NFT scams are rampant, and users do not know which proejcts to trust. Our project included two main parts: the smart contracts (deployed on an Ethereum testnet) and an API to interpret the smart contracts.",
      "placement": [
        "Security",
        "Blockchain"
      ],
      "project_name": "Honest Protocol",
      "team_members": "Alexis Mack, Kaili Wang, Jeff Tsang, Ryan Tan"
    },
    {
      "description": "Collide helps you break social barriers. By notifying you when people with shared interests are nearby, this mobile app creates opportunities to meet people you would have otherwise passed by. With Collide, your next best friend is just around the corner!",
      "placement": [
        "Social",
        "Mobile"
      ],
      "project_name": "Collide",
      "team_members": "Ekin Tiu, Enok Choe, Emily Hsu, Christian Figueroa"
    },
    {
      "description": "Discover who's on your Wavelength. Each week, submit your favorite song and our matching algorithm will match you with someone else on campus who listened to a different, but similar song. Make a new friend and discover new music along the way!",
      "placement": [
        "Social"
      ],
      "project_name": "Wavelength",
      "team_members": "Amy Zhang, Juyon Lee, Hanna Yip, Trinity Donohugh"
    },
    {
      "description": "“Margaret” is an interactive short story that takes the form of a text conversation between the reader and a chatbot. Through an alternative form of storytelling, this project aims to incorporate user interaction to explore character construction and development in fiction.",
      "placement": [
        "Other"
      ],
      "project_name": "Margaret: An Interactive Short Story",
      "team_members": "Lily Zhou"
    },
    {
      "description": "A round-robin game in which users produce a poem together by each contributing one line at a time.",
      "placement": [
        "Education",
        "Games"
      ],
      "project_name": "Collaborative Poetry Game",
      "team_members": "Diego Balvin, Jen Luo, Meilinda Sun"
    },
    {
      "description": "Vahana is a phone app designed to help new drivers improve their driving in a fun and engaging way. Think Strava meets Spotify Wrapped for driving.\n\nVahana allows users to record their driving, and then analyses and rates their drives with a safety score. Vahana also provides monthly statistics on users' driving progress. By recording safety score trends and analytical data, Vahana hopes to enable users to become safer drivers.",
      "placement": [
        "Education",
        "Mobile",
        "Automotive"
      ],
      "project_name": "Vahana",
      "team_members": "Alex Fu, Catherine Huang, Julia Kadie, Nick Mayhew"
    },
    {
      "description": "A drawing is worth a thousand beats; Drawdio will generate them for ya! Go to https://tinyurl.com/194-drawdio and dump your thoughts into a sketch. Drawdio will translate your drawing into music 🎵",
      "placement": [
        "Games",
        "Social",
        "Other"
      ],
      "project_name": "Drawdio",
      "team_members": "Akram Sbaih, Donte Leon Townes, Justice Tyler, Dominic DeMarco, Jonathan Victorino"
    },
    {
      "description": "AllSpice is your favorite recipe-sharing app, perfect for storing recipes, sharing your creations with your friends, and following along with your friends' cooking adventures!",
      "placement": [
        "Social"
      ],
      "project_name": "AllSpice",
      "team_members": "Valexa Orelien, Shreya Ravi, Anne Lee, Ben Choi, Isabelle Lee"
    },
    {
      "description": "In this project we aim to establish the relationship between the\nconstruction of an acoustic guitar and the resulting frequency and\namplitude response. The forward modeling problem is to take as\ninput the physical material parameters and geometry of a guitar\nand use FEM methods to perform modal analysis. This part involves\nmodeling the guitar meshing, elasticity coefficients for the wood,\nand different boundary conditions. The inverse problem (the more\ninteresting case) is to take as input the a user defined “sound” and\nfind the best parameters for a guitar that would produce such a\nsound",
      "placement": [
        "Other"
      ],
      "project_name": "Computational Design of Guitars",
      "team_members": "Samaksh Goyal, Mark Rau, Doug James"
    },
    {
      "description": "Vahana is a phone app designed to help new drivers improve their driving in a fun and engaging way. Think Strava meets Spotify Wrapped for driving.\n\nVahana allows users to record their driving, and then analyses and rates their drives with a safety score. Vahana also provides monthly statistics on users' driving progress. By recording safety score trends and analytical data, Vahana hopes to enable users to become safer drivers.",
      "placement": [
        "Education",
        "Mobile",
        "Automotive"
      ],
      "project_name": "Vahana",
      "team_members": "Alex Fu, Catherine Huang, Julia Kadie, Nick Mayhew"
    },
    {
      "description": "Kara aims to revolutionize the donation experience of people worldwide. \n\nKara is designed as a social network that connects donors (mentors) with people in need of financial help (protégés). Protégés and mentors are matched based on their preferences and can form a personal relationship through private messaging and interaction via social feeds. Mentors can directly send money to their protégés, helping them achieve their basic needs. Once that need is met, mentors get notified via a picture, call or video, which allows them to directly see the impact of their donation. \n\nKara aims to increase worldwide donations by providing an intuitive platform with mechanisms designed to incentivize donors to give more.",
      "placement": [
        "Education",
        "Finance",
        "Social",
        "Other"
      ],
      "project_name": "Kara : A social network to reduce the world's inequality",
      "team_members": "Houda Nait El Barj, Julio Ballista, Jhonatan Ewunetie, Neena Dolores Romero, Rayan Albraidi"
    },
    {
      "description": "Parea is the home base for caretakers of patients with Autism Spectrum Disorder.",
      "placement": [
        "Healthcare",
        "Social"
      ],
      "project_name": "Parea",
      "team_members": "Lyna Kim, Taylor Lallas, Griffin Tarpenning, Mehul Arora"
    },
    {
      "description": "Analytics are crucial to baseball front offices, helping management measure the true impact of players and coaches improve player performance. For this project, we worked closely with the Los Angeles Dodgers to develop a mobile app and API using deep-learning to extract patterns in player positions that can be used to improve performance. Our app enables coaches and players at the professional and amateur levels to use our model on uploaded video clips of players to better understand players' movements and how they relate to play outcomes and success on the field.",
      "placement": [
        "Mobile",
        "Other"
      ],
      "project_name": "Data Dodgers",
      "team_members": "Raaisa Moktader, Jack Andraka, Peter Chatain, Ryan Atkins, Griffin Miller"
    },
    {
      "description": "Chia Card is a service which enables sponsors to gift chia (XCH) to various recipients. Regardless of whether recipients are Crypto/Chia veterans or fledglings, our service ensures they enjoy a seamless and open welcome to the Chia community.",
      "placement": [
        "Environment",
        "Blockchain",
        "Commerce"
      ],
      "project_name": "Chia Card",
      "team_members": "Natasha Ong, Lydia Chan, Nathaniel Goenawan, Andy Khuu, Vincent Heng"
    },
    {
      "description": "How can historical experiences in VR be more engaging and better support cultural learning? How do we provide replay value, ie. encourage users to return to explore other sites? How do we scale this process? Our project explores each of these questions, working with Meta’s Global Historical Archive (GHA). We present a personable VR prototype experience, including interactions with culturally relevant characters, and a scalable narrative framework to apply to future historical sites. We also present an immersive VR trivia experience, which solidifies user’s historical knowledge gained through the narrative experience.",
      "placement": [
        "Education",
        "Games",
        "Virtual or Augmented Reality",
        "Social"
      ],
      "project_name": "Reimagining and Scaling Historical Storytelling in VR (GHA)",
      "team_members": "Gizem Incesu, Jessica Chen, Emily Redmond, Nicholas Vo"
    },
    {
      "description": "Our overarching goal is to explore the possibilities of camera mechanics in GHA and develop a camera feature that is engaging to users. Aside from the traditional expectations of a camera to take pictures and store them in an album, we also want to leverage the reality-defying aspect of VR by implementing features that allow users to collect and replicate artifacts using the camera. The test and implementation of these ‘non-traditional’ features will be realized through a museum-themed outer game loop where the player can curate a museum by visiting new sites, taking pictures and collecting artifacts.",
      "placement": [
        "Education",
        "Games",
        "Virtual or Augmented Reality"
      ],
      "project_name": "Moment",
      "team_members": "Nina Du, Abla Ghaleb, Landis, Bhagirath Mehta, Mia Miao"
    },
    {
      "description": "Fetch your love for adventure and put on an Oculus Quest 2 headset to embark on a 10-minute archaeology-themed experience at one of the wonders of the world, the prehistoric monument of Stonehenge. In this game, you are a graduate student searching for project inspiration under the guidance of your eccentric professor.\nExplore the richly rendered environment, discover historical artifacts, and perhaps even converse with the storytelling spirits of the past. Do you have what it takes to craft your own theory about the mysteries of Stonehenge?\n(This was made in collaboration with Meta’s Global Historical Archive.)",
      "placement": [
        "Education",
        "Games",
        "Virtual or Augmented Reality"
      ],
      "project_name": "ARCH: A VR Stonehenge Storytelling Experience",
      "team_members": "Shana Hadi, Jonathan Kula, Lina Fang, Jiahui Chen"
    },
    {
      "description": "Have you ever been looking to hit a concert, hike, or day trip, but your friends aren't available or you want to go with new people? DayTripper can be your means to connect with fellow college students and organize an incredible day.",
      "placement": [
        "Social",
        "Mobile"
      ],
      "project_name": "DayTripper (iOS)",
      "team_members": "Jasper Den Otter, David Malinak, Emmanuel Ayumba, Tyler Eischens"
    },
    {
      "description": "Trippy is a mobile application that aims to alleviate the task of dispersing incurred expenses and encourage groups to set and meet spending goals. Trippy tracks and handles incurred expenses throughout the trip by prompting users if recent purchases are part of the group expense. Once joint expenses have been confirmed, the app calculates what each party of the transaction owes.",
      "placement": [
        "Finance",
        "Social",
        "Mobile"
      ],
      "project_name": "Trippy",
      "team_members": "Anthony Perez, Carolyn Asante-Darte, Sihguat Torres, Delali Azamati, Hana Tadesse"
    },
    {
      "description": "Car maintenance tracking, recording and reminders",
      "placement": [
        "Automotive"
      ],
      "project_name": "Vehica",
      "team_members": "David Ihim, Justin Tinker, Oluseyi Olujide"
    },
    {
      "description": "The Illusion architecture is designed to run deep learning workloads with total energy and execution time near that of an ideal single chip. The scaleup project aims to demonstrate that the architecture can keep pace with growing neural network sizes while maintaining its low overheads. Ongoing verification of a new chip that will demonstrate scaleup involves emulating the design in hardware to accelerate logic simulations. Emulation will allow the development team to test scaling the system before fabricating the design.",
      "placement": [
        "Other"
      ],
      "project_name": "Emulating Illusion Scaleup for Neural Network Applications​",
      "team_members": "Ben Auslin"
    },
    {
      "description": "Carpe is an app built to facilitate community based carpooling.",
      "placement": [
        "Social",
        "Mobile",
        "Automotive"
      ],
      "project_name": "Carpe",
      "team_members": "Nebyou Zewde , Rafael Esteves, Ayush Agarwal"
    },
    {
      "description": "We want to create a platform that will facilitate and encourage people to create and join advocacy groups. Our platform will allow people to plan and sign up for events and for people to receive notifications from causes they are following. Each person will have a home page of the causes they follow. The platform will also allow people to sign up for specific tasks to support an event.",
      "placement": [
        "Social"
      ],
      "project_name": "Advocacy Work Manager",
      "team_members": "Huong Nguyen, Drew Wadsworth, Abi Lopez, Xuchen Wei"
    },
    {
      "description": "The \"cold start\" or new user problem has long plagued recommender systems. In order to resolve this problem before a user churns, exploration mechanisms are applied to learn the user's preferences in as few interactions as possible. This project introduces a novel exploration mechanism based on determinantal point processes that results in more sample-efficient exploration. It also introduces a standardized testing pipeline for exploration mechanisms based on the MovieLens dataset and a baseline Deep Q-Learning model.",
      "placement": [
        "Education",
        "Social",
        "Commerce",
        "Other"
      ],
      "project_name": "Applying Determinantal Point Processes for Sample-efficient Exploration in Recommender Systems",
      "team_members": "Dhruvik Parikh"
    },
    {
      "description": "Split seeks to revolutionize the way friends split bills. Our platform will serve as a tool where users will no longer need to make calculations themselves, but simply take a picture of the receipt and select other users to share the payment with. Users will no longer have to overpay for that one friend that orders too much. We strive to provide consumers with a nuanced approach to bill splitting amongst friends.",
      "placement": [
        "Finance",
        "Social"
      ],
      "project_name": "Split: splitting bills made easy!",
      "team_members": "Robert Hu, Luis Alcaraz, Josh Shongwe, Karen Chen"
    },
    {
      "description": "We built a crows-sourced educational website which allows you to describe and organize different topics or fields (like Computer Science, Basketball, Math etc) in a tree-based hierarchy. It is like a cross between wikipedia and skillshare, meant to both help people understand what is out there and how to approach big fields and to find the appropriate tutorials for the skills needed as they progress through a field or subfield! Users can save trees, create trees and contribute to other trees.",
      "placement": [
        "Education"
      ],
      "project_name": "Skilltree",
      "team_members": "Rhett Owen, Trisha Kulkarni, Frankie Cerkvenik"
    },
    {
      "description": "Non-accidental trauma (NAT) includes diagnoses such as domestic violence, assault, poisoning, and abuse. In this project, we developed a transformer-based model that uses electronic health record data to predict future diagnosis of NAT. Our model outperforms XGBoost and current state-of-the-art deep learning methods. Key to its performance was the use of a pretraining task for last visit summarization as well as incorporation of demographic and procedural features.",
      "placement": [
        "Healthcare"
      ],
      "project_name": "Transformer for Non-Accidental Trauma Prediction from Electronic Health Records",
      "team_members": "David Huang, Prof. David Kim (advisor), Prof. Serena Yeung (advisor)"
    },
    {
      "description": "SALVIS is your one-stop shop for building your program and will make the process of choosing your courses fun and exciting. With friendly visuals and graphs to help you visualize and track progress, you no longer have to wonder about which requirements you may be missing.",
      "placement": [
        "Education"
      ],
      "project_name": "SALVIS: Time to get rid of the excel sheet",
      "team_members": "Tristan Sinclair, Renasha Mishra. Yasmine Mitchell, Daulet Tuleubayev"
    },
    {
      "description": "This work uses various machine learning techniques (neural nets, SVMs, decision trees, etc.) to augment flow size estimates made from count-min sketching.",
      "placement": [
        "Other"
      ],
      "project_name": "Flow Size Estimation Using Count-Min Sketches and Machine Learning",
      "team_members": "Ishan Gaur"
    },
    {
      "description": "How can we ease the burden of natural language data labeling and design virtual assistants that can correct errors made in understanding user input? In this project, I prototype a tool to simplify the process of labeling new training data for dialogue systems, and I explore methods of correcting a virtual assistant’s mistakes when interacting with a user.",
      "placement": [
        "Other"
      ],
      "project_name": "Virtual Assistant Error Correction",
      "team_members": "Nathan Marks"
    }
  ]
}