{
    "submissions": [
        {
            "class": "CS210",
            "project_name": "TracVR",
            "summary": "An Unreal engine plugin that uses machine learning to guess the location of a VR player's shoulders and elbows based on the locations of the hands and head",
						"description": "VR is one of the fastest growing tech phenomena around, and TracVR is on the cutting edge.  The main VR devices on the market only track the player's head and hands, forcing developers to either use inaccurate inverse-kinematics to approximate the rest of the body, or leave the player a disembodied ghost, distancing them from the most immersive experiences VR has to offer.  TracVR is the third solution.  Using machine learning trained from data recorded using our custom motion-tracking,  TracVR can accurately predict a player's movements in real-time, maintaining the immersion that is at the core of all of VR.",
						"team_members": "Caitlin Go, Hansohl Kim, Jessica Taylor, John Valentine",
            "placement": "vr",
            "logo_url": "https://lh3.googleusercontent.com/PQVByapPt_L1pL6k_DrdnF10pj12aGbPm4-ADhlD9dsltLW58AeoyhdTUhRpNT72oz59S5qWxWhZ948=w2422-h1452-rw"
        },
        {
            "class": "CS210",
            "project_name": "Cipher",
            "summary": "Cipher aims to simplify the process of sharing medical records by managing record access permissions through the blockchain.",
            "team_members": "Julian Arellano, Pablo Hernandez, Noah Makow, Fidel Salgado, Zack Swafford",
            "description": "There exists a huge inefficiency in the healthcare sector when it comes to sharing medical records between locations (hospitals, clinics, etc.). Cipher aims to give its users more control over their medical records by creating a mobile application through which users can visualize and share their health records. We use the blockchain to house our smart contracts, which outline our patient-provider relationships that define the medical record queries and who has access to run this information. We provide a way for users to always have their medical records on hand, as well as a way for easy sharing to another user on our application. This distributed database approach for record sharing could be implemented by hospitals with minimal overhead needed on their side to better service their patients and give them more ownership into their health.",
            "placement": "health",
            "logo_url": "https://lh4.googleusercontent.com/ptUI1Wm_oV9G2kXwtf30qta4nS7vC9ApaJJPsynhus8CAbnv5cxw7kBYp64_w9FclSS9F7jOCQZ-uQc=w2422-h1390"
				},
				{
            "class": "CS210",
            "project_name": "Newton",
            "summary": "Mobile car to car communication to prevent accidents",
            "team_members": "Simar Mangat, Veeral Patel, Lawrence Murata",
            "description": "We are using data on smartphones and a high-accuracy GPS system to predict the paths of vehicles and foresee dangerous situations. With that, we will give drivers valuable real-time insights through an interface that builds trust between drivers and vehicles by showing how our algorithms generate information and sending real-time warnings to avoid accidents.",
            "placement": "arcade",
            "logo_url": "https://lh4.googleusercontent.com/hr-mHmRopfmqmMTtboxpJjOEfzwXZwHLcWGfOQSJtFwumRMh6N5nIDvvn74RemvcqTu30JfcO33cR1M=w2422-h1390"
				},
				{
            "class": "CS210",
            "project_name": "Spotlight",
            "summary": "An AI-powered mobile app that recommends highlights of your video",
            "team_members": "Sherwin Xia, Koki Yoshida, Eric Li, Wendi Liu, Junting Hsieh",
            "description": "We are building the brain to create breathtaking highlight videos. Having state-of-the-art deep learning and computer vision algorithms behind the scene, our mobile app is able to help you find highlights of your video. Generate and share your highlights to your friends or on social media by one-click.",
            "placement": "consumer",
            "logo_url": "https://lh5.googleusercontent.com/dzP4HsEtnLNdBBwTGpI6oWob3CE6wb3Xz3W5iKlRebMd_Dsk-qXwqDF2mu7uurjEjxG1Iqa8x0DwIUg=w2422-h1390-rw"
        },
				{
            "class": "CS210",
            "project_name": "Spark: A Student Engagement Initiative",
            "team_members": "Charles Akin-David, Jorge Cueto, Alexander Wang, Serena Wong, Jessica Zhang",
            "summary": "We leverage Facebook technologies to spark students’ curiosity and lasting interest in new fields and careers.",
						"description": "Spark is a program designed to give high school students equitable access to engaging content about tech-related career pathways and opportunities, as well as enabling students to interact directly with role models in those careers. We believe that connecting students with viable careers and relatable role models in a variety of fields they otherwise might not have access to has the potential to spark their interest in learning more, expand their view about what’s possible, and inspire them to pursue a career  in technology. We worked with role models from a variety of backgrounds to create compelling videos about their careers and personal pathways. The videos are posted in our Spark Facebook group, which contains a variety of subgroups, each corresponding to an interest area that intersects with computer science and tech in a meaningful way (e.g. Art, Music, Diversity, Careers, Social Good, Education, Sports, etc.). Our role models are excited and committed to making sure no question goes unanswered! In addition to videos, questions and comments, role models can also interact with students through Facebook live videos, blogs or websites.",
            "placement": "education",            
						"logo_url": "https://lh3.googleusercontent.com/H5R2-Rc9hvrH5s9r2bogE6Xp5pkXFnzb329qIH4GsHD-jqCuatKtpqR7vhyPlSNLqRcNyqipuTk8SbE=w2422-h1390-rw"
        },
				{
            "class": "CS191",
            "project_name": "Learning Healthcare for Interventional Radiology",
            "team_members": "Ellen Blaine",            
						"summary": "Web application to gather data for deep learning in radiology",
						"description": "This Angular 2/Java application makes it easy for clinicians and their colleagues to collect structured data on patient risk factors and outcomes. Ultimately, this data will be part of a precision medicine pipeline to advise interventional radiologists on anticoagulation routines and procedure access sites. If successful, the app and deep learning system will be ported to other medical domains. The initial clinic launch has been successful. Since then, efforts have been focused on integrating the software with existing hospital infrastructures.",
            "placement": "health" 
        },
				{   
            "class": "CS191",
            "team_members": "Josh Beal",
            "project_name": "Privacy-Preserving Knowledge Transfer for Hand Hygiene Detection",
            "summary": "Improving the privacy of a computer vision system for hand hygiene detection",
            "description": "We use a state-of-the-art strategy for secure knowledge transfer and aggregation to improve the privacy of a computer vision system for hand hygiene detection. Given a learning context involving multiple hospitals, we develop an accurate and robust classification system that preserves the privacy of each hospital’s data and avoids model inversion attacks that would put all parties’ training data at risk. We demonstrate strong differential privacy bounds on the resulting classifier, and characterize performance and privacy bounds for a range of architectures and aggregation parameters in the student-teacher ensemble approach.",
            "placement": "research"
        },
				{
            "class": "CS191",
            "team_members": "Aashna Mago, David Mora",
            "project_name": "Virtual Reality in Education",
            "summary": "How might virtual reality empower learners to explore and understand the incredible world around us in ways not possible in traditional education? Our VR experience investigates one instance of these possibilities — immersing learners in a world where exploring the chemistry of combustions engines isn’t presented as a series of abstract concepts, but rather takes form in the tangible, explode-able puzzles around you, empowering the central paradigms of chemistry themselves to propel you through the adventure.",
						"description": "To be honest, the two of us are biased when it comes to education: we think learning is deeply human -- thrilling, challenging but satisfying, an illumination of the world around us we bring our full mind to. Unfortunately, this isn’t part of most people's educational experiences. We wondered how the emerging technology of virtual reality (VR) might embody the exciting paradigms we believe educational systems should reflect. While early endeavors to use virtual reality in education are encouraging, they ultimately seem to be attempts to manifest pre-existing paradigms in a shinier box: field trips can now be taken “virtually,” classrooms become “virtual,” 2D images can now be bigger, shinier “virtual” 3D models. In response, we spent the quarter asking: If we can create worlds in VR, what worlds deeply foster our human capacity to learn? Research responds clearly: a world where learners can play with concepts before being asked to master them, feedback is timely and intuitive, and where tasks orient around missions, not rigid instructions. In short: game mechanics. So we built one demonstration of what that world might look like in VR. As an unsuspecting janitor trapped in top secret science lab, you experience the science of chemistry and combustion, not as “educational material,” but as the secrets to unlocking puzzles, taming whizzing molecules, and blasting your way through the unfolding perils of the lab.", 
            "placement": "education"
        },
				{
            "class": "CS210",
            "team_members": "Cheenar Banerjee, Priya Ganesan, Patricia Perozo, Kimberly Wijaya",
            "project_name": "Haven",
						"summary": "Haven connects NGOs with community volunteers during the aftermath of a crisis so that neighbors can help each other recover and rebuild.",
						"description": "In the aftermath of a publicized natural disaster, spontaneous unverified volunteers often arrive at the scene in the hundreds or even thousands. These volunteers are regular people who want to help rebuild their own communities, but aren’t necessarily skilled or trained and, without proper instruction, can often do more harm than good. Haven connects these volunteers with non-governmental organizations that are doing relief work in the area so that volunteers are able to find ways to help that both suit them and aid their community. Haven’s web platform gives non-governmental organizations the ability to post about volunteer opportunities, manage volunteers, and coordinate efforts with other organizations, while Haven’s mobile app offers volunteers an easy way to find volunteer tasks that match their skills and preferences.",
          "placement": "enterprise-public-policy",
					"logo_url": "https://lh5.googleusercontent.com/rpYg0QI4P0zLvYvbHjzvNumuWYD8mGfja1JJjTv13y6qf_m7DEuDMseRXF81u9m7rOXrAQjKwus93ug=w2422-h1390-rw"
        },
				{
            "class": "CS191",
            "team_members": "Saachi Jain",
            "project_name": "SnapTime",
            "summary": "SnapTime is a system for multivariate time-series analysis.",
            "description": "Across multiple domains, large amounts of multivariate timestamped data are collected to solve key questions about systems over time. However, the overhead of slicing and processing this data results in custom code, leading to duplicated work with significant overhead. SnapTime is a flexible system that performs end-to-end analysis on multivariate time-series data. Allowing for efficient parsing, querying, and time-step inflation, SnapTime simplifies and speeds up processing of time-series data-sets. The system’s validity was then evaluated using water heater and automobile sensor data.",
          "placement": "research"
        },
				{   
            "class": "CS210",
            "team_members": "Jacob Hoffman, John Morgan, Jordan Hank, Josh Cohen",
            "project_name": "Synapse",
            "summary": "Synapse is a low data app that helps individuals on the ground share information in the immediate aftermath of a disaster.",
            "description": "Be prepared for disaster with Synapse. Synapse is a mobile crowdsourcing platform that takes in user generated information about a disaster, verifies the data, and shares accurate reports with users. Synapse is designed for low-connectivity situations, and limits data consumption to provide a seamless experience in scenarios where internet connectivity is spotty. Users can report road closures, aid stations, and more through the Synapse Android application, and can view verified reports through the app and through the Synapse SMS client. A Synapse web portal gives approved administrators a birds-eye view of the disaster. The Synapse mobile application, SMS wrapper, and web portal can help civilians and governments build an accurate picture of the situation on the ground in the immediate aftermath of a disaster.",
          "placement": "enterprise-public-policy",
					"logo_url": "https://lh6.googleusercontent.com/fclGUlSpuf3RDQJ8cKf-3yiVsQ3jiRI-oHS1kF4JBAQBW5vnSZHAQrE9LMgHKcubdFCBvvkxENAQRf4=w2422-h1390"
        },
				{  
            "class": "CS191",
            "team_members": "Dana Murphy",
            "project_name": "Mazeweaver",
            "summary": "A mobile puzzle game. Navigate a dungeon and block your enemies from the goal without getting caught or blocking yourself!",
            "description": "Mazeweaver is a puzzle game about a young magic user escaping a goblin dungeon. Players must use their surroundings, as well as their unique ability to create magical blockades, to block enemies from the exit without getting caught or blocking themselves. The game consists of nine levels, and includes a tutorial and a “challenge” mode. The project also includes a full mobile interface for interacting with the game.",
          "placement": "arcade",
          "logo_url": "https://lh6.googleusercontent.com/63qpwT0SjV2Wf0OFrUJnnG4IjKV5eRTV5TyVhj8AJsLCHrbsiiy4-7lvAavrwLmRgQa6EnZgG1pp6xI=w2422-h1390"
        },
				{
            "class": "CS191",
            "team_members": "William Shen",
            "project_name": "Towards Generalizable Perception: A Computational Model of Task Space and Optimal Supervision",
            "summary": "Towards developing a generalized perception by computationally modeling the task space and optimizing towards optimal supervision.",
            "description": "The human brain is astonishing in its flexibility. Our best artificial systems, which are often loosely modeled on the brain, can only perform one or a few tasks with proficiency. By understanding how visual tasks are related, we can build better models and may gain insight into the brain.",
          "placement": "research"
        },
				{
            "class": "CS191",
            "team_members": "Gene Lewis",
            "project_name": "Implementing A Real-Time Obstacle Detection Platform",
            "summary": "We designed and implemented a modular perception platform that runs in real time on an autonomous vehicle.",
            "description": "In this project, we designed and implemented an object detection perception platform. Our platform is modular, naturally parallelized, easily extensible, and can handle any timing requirement. Our platform was built under the direction of the Stanford Dynamic Design Laboratory and the Stanford Intelligent Systems Laboratory, and has been tested on an autonomous Ford Fusion.",
          "placement": "research"
        },
				{   
            "class": "CS210",
            "team_members": "Jake Rachleff, Jack Payette, Eric Ehizokhale, Austin Chambers, Reese Pathak",
            "project_name": "VARScan - Environment Capture for Creators",
						"summary": "VARScan is an environment scanning solution that makes content creation for Virtual Reality easy and affordable.",
            "description": "VARScan is an end-to-end environment scanning solution that allows users to create content for VR easily and at a low cost.  Our product will enable content creation at a price and ease of use that is unavailable on the market today.  With a main target audience of Social VR, VARScan will allow you to capture your world and both experience and share it in VR applications.  We combine a software and hardware modules in order to maximize the value that we can deliver to the user, while maintaining a very low price.",
          "placement": "vr",
					"logo_url": "https://lh6.googleusercontent.com/SC7aTOnXTQfbx_u1083OuQyTVt_Ve99aAtnnoAk7eC4sunMVlr0ygGzQHN_qmB7QXA2_VMaV52iBOOo=w2422-h1478-rw"
				}	
	]
}
