{
  "submissions": [
    {
      "class": "CS191",
      "description": "Sebastian is a tiny scripting language for music theory. It provides powerful features for representing and manipulating music analysis symbols, and can generate common-practice-period harmony. Sebastian is unique: unlike other tools with audio focuses, Sebastian focuses on manipulation of music theory symbols.\n\nSebastian generates MusicXML files as output, which can be rendered into sheet music by many other programs (Finale, Sibelius, MuseScore, etc) and libraries (VexFlow, LilyPond, etc).\n\nSebastian is also highly extensible. Although it generates common-practice-period (baroque) harmony by default, the rules are entirely separated from the code, and can be easily overridden or altered. New rules governing the harmonic output can trivially be added, or replace the standard rules entirely.\n\nSebastian can work on its own, or as a js library to power web apps and other microservices.",
      "placement": "Music & Social",
      "project_name": "Sebastian",
      "summary": "Sebastian is an embeddable expert system that generates musical four-part chorales from chord symbols, in the common practice period style.",
      "team_members": "Dylan Hunn"
    },
    {
      "class": "CS191",
      "description": "Goji (Gamified ObJect-based Interpreter) is a lightweight, end-to-end markup language, interpreter, and renderer to develop gamified web experiences. The first Goji use cases are e-learning and e-commerce applications, but gamification principles are highly-applicable and customizable. Goji's syntax draws inspiration from the Python stack, and, in its data exchange functionality, addresses some of the syntactic inefficiences of JSON. The Goji interpreter is written in Python and will interpret any properly constructed .goj file.",
      "placement": "Systems & Security",
      "project_name": "Goji (Gamified ObJect-based Interpreter)",
      "summary": "A lightweight, end-to-end markup language, interpreter, and renderer to develop gamified web experiences.",
      "team_members": "Valerie Ding"
    },
    {
      "class": "CS191",
      "description": "This project combines techniques from locality sensitive hashing and statistical profiling into a system that ingests random samples of a process's instruction pointer to generate a stable fingerprint of the process. This approach can enable detection of malicious code, not by a static analysis of binary files, but by efficiently and transparently analyzing the instructions actually executed on the CPU. It is intended to be robust against obfuscation techniques employed by malware designers, such as encryption of executable code under a device-specific key, as well as VM-detection approaches. The algorithm works by combining frequency and time-series information into a single MinHash-based fingerprint vector which is robust to variability stemming from sampling error and address space layout randomization.",
      "placement": "Systems & Security",
      "project_name": "MORPH: Malicious Obfuscation Resistant Process Hash",
      "summary": "A system for efficiently and robustly fingerprinting running processes by sampling the CPU state.",
      "team_members": "Will Bradbury"
    },
    {
      "class": "CS210",
      "description": "At EduGate, we believe that equitable, accessible, and high-quality education is one of the most powerful ways to empower people. In particular, as technology becomes ever more integrated into our daily lives, computer science is rapidly becoming one of the most critical parts of a modern education. The problem is that it can be very challenging for students to get started in CS. \n\nTherefore, our mission is to empower any teacher, of any background, to bring computer science into their classroom. We are a free, collaborative, crowd-sourced platform for creating and sharing CS curriculum with other teachers, with a particular focus on giving teachers the resources they need to quickly build confidence and competence in CS.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/simple%20logo%20-%20white%20-%20Vivian%20Hoang-Dung%20Nguyen.png",
      "placement": "Education",
      "project_name": "EduGate",
      "summary": "EduGate is a teaching tool for teachers to share resources and interact in a collaborative community.",
      "team_members": "Jaimie Xie, Emily Ling, Vivian Nguyen"
    },
    {
      "class": "CS210",
      "description": "Marker Metrics is building the next-generation play-testing software for game developers using biometric sensors. The software plugs into the game, merges game data with streams from biometric sensors and helps developers analyze their games. Biometric sensors provide a method to get objective real time insight into a player’s experience. We measure heart rate and electrodermal activity and relate them to in-game events to provide a quantitative insight into player’s reactions.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/marker-metrics%20-%20Connor%20Brinton.jpeg",
      "placement": "Games & VR/AR",
      "project_name": "Marker Metrics Playtesting Suite (MMPS)",
      "summary": "Providing quantitative insight into video games by correlating biometric data and in game events in a way that's useful to designers.",
      "team_members": "Connor Brinton, Colin Clemmons and Anand Dhoot",
      "team_name": "Marker Metrics"
    },
    {
      "class": "CS191",
      "description": "Drug discovery project teams often test compounds very different from known drugs, making the application of machine learning in this field very different from that in other fields. This project attempts to reduce this unique overfitting problem by proposing a new validation strategy based on the digital representation of input molecules. Ultimately, this projects examines whether digital representation or chemical intuition best characterize differences among drug molecules when applying machine learning.",
      "placement": "Health & Biomedical",
      "project_name": "New Validation Strategy for Machine Learning in Drug Discovery",
      "summary": "This project introduces a new validation strategy for applying machine learning to drug discovery. The validation is based on clustering of representations of molecules.",
      "team_members": "Doris Mai"
    },
    {
      "class": "CS191",
      "description": "Decentralized exchanges (DEXs) are an emerging application of blockchain technology that allow entities to trade digital assets without a trusted third party. Numerous attempts have been made at building effective DEXs. In this paper, we enumerate a list of desired properties of DEX protocols and then evaluate four DEX implementations systems built on Ethereum using these considerations. We finally propose and implement two modifications to the 0x protocol, a popular DEX protocol on Ethereum.",
      "placement": "Blockchain",
      "project_name": "A Survey of Decentralized Exchanges on Ethereum",
      "summary": "We enumerate several desired properties in decentralized exchanges and analyze four popular decentralized exchange protocols and propose two modifications to the 0x protocol.",
      "team_members": "Yunha Hwang, Noah Golub, Charles Lu"
    },
    {
      "class": "CS194",
      "description": "As course staff for the introductory computer science courses, we've identified memory and code visualization as a major student pain point. Students struggle with differences between the stack and the heap, levels of indirection, and references, all of which are key concepts to understanding LinkedLists, Binary Search Trees, Tries, and other CS106B concepts. Historically, the most effective way to explain these concepts has been to draw memory diagrams by hand, but these are example-specific and limit student exploration and agency. We hope that this tool will be used both as an explanation for how code is run behind the scenes as well as a mechanism to boost student understanding of their own code. This tool will be used in CS106B next quarter.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/logo%20-%20Maria%20Yang.png",
      "placement": "Education",
      "project_name": "See++",
      "summary": "See++ is a code visualization tool designed to help students taking introductory algorithms and data structures courses in C/C++ (i.e. CS106B/X).",
      "team_members": "Kashif Nazir, Ashley Taylor, Lucy L Wang, Maria Yang"
    },
    {
      "class": "CS191",
      "description": "Development of safe autonomous control systems requires accurate probabilistic models of human behavior. GAIL has become a popular option for training such models in sequential decision making tasks. This technique, inspired by GANs, trains a policy and discriminator network against each other in order to create a policy that generates a state occupancy distribution of minimal divergence from provided expert trajectories. Here radar data from terminal airspace is used to train a policy that human landing patterns around an airport.",
      "placement": "Autonomous Systems & ML",
      "project_name": "Generative Adversarial Imitation Learning for Terminal Air Traffic Modeling",
      "summary": "Using imitation learning to model pilot decisions in terminal airspace for use in airspace safety guidelines",
      "team_members": "Nate Gruver"
    },
    {
      "class": "CS210",
      "description": "​We worked with the United Nations and SAP to build software that provides developing nations and response groups with satellite data that they can use to mitigate the effects of natural disasters. Leveraging the Google Earth Engine API, we built a tool that allows aid dispatchers to quickly estimate the number of people living in a given area as well as easily locate viable water sources, anomaly populations, and safe havens. Our tool renders an actionable map in preparation for these administrators to triage crucial resources during times of natural disaster and optimize planning efforts in order to save the most lives possible.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/Canary%20logo%20-%20Ali%20Grace%20Eicher.jpeg",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "UN Population Heat Mapping and Resource Detection using Satellite Data for Disaster Preparation and Response",
      "summary": "We democratize satellite data and empower developing nations to respond to natural disasters by overlaying crucial relief resources and information on top of satellite maps.",
      "team_members": "Alexandra Eicher,  Connie Li, Chris Lucas, Regina Nguyen, Jeffrey Yu",
      "team_name": "Canary"
    },
    {
      "class": "CS191",
      "description": "We trained dense convnets on 30,000 abdominal x-ray images provided by Stanford Radiology, achieving 0.7 AUROC.  We  also investigated how  performance relates to the size of the training set.",
      "placement": "Health & Biomedical",
      "project_name": "Finding Abdominal X-Ray Abnormalities with Dense Convnets",
      "summary": "We trained dense convnets on 30,000 abdominal x-ray images provided by Stanford Radiology, achieving 0.7 AUROC.  We  also investigated how  performance relates to the size of the training set.",
      "team_members": "Adam Jensen"
    },
    {
      "class": "CS194",
      "description": "Living with roommates after college can be a fun but also stressful time. Often, there are many costs and chores that are shared between roommates. It can sometimes be difficult to manage and visualize these expenses in a fair and stress-free way. Not only can the payments be stressful, but coordinating chores can be too. With Coop, we want to offer a platform to streamline the roommate experience. We hope to eliminate the unnecessary conflicts and misunderstandings that come with managing finances and chores with roommates.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/coop_logo2%20-%20Gabriel%20Previte.png",
      "placement": "Music & Social",
      "project_name": "Coop",
      "summary": "One-stop shop for managing roommate life",
      "team_members": "Benjamin Williams, Gabriel Previte, Janet Hu, Trevor Danielson, Wesley Olmsted"
    },
    {
      "class": "CS191",
      "description": "The project is meant to be a demonstration system of automotive risk prediction research conducted previously. It involves combining state-of-the art object detection systems with many other components to create a complete system. Extra care must be taken to ensure everything works in real-time. Many of the challenges arise due to the real-time constraint and the common-objects constraint. The system runs using only video input for the object detection and vehicular state estimation, and GPS from a phone. Furthermore, it runs on a laptop that sits in the vehicle.",
      "placement": "Autonomous Systems & ML",
      "project_name": "Automotive Risk Prediction System",
      "summary": "Building a full demonstration system to predict automotive risk in real time using easy to find components.",
      "team_members": "Derek Phillips"
    },
    {
      "class": "CS194",
      "description": "Every day public transit networks (PTNs) play a critical role in the lives of millions of people. Because of their importance, one developing trend is the use of numerical graph methods in order to examine different aspects of a PTN, such as equity, transit frequency, and vulnerability. Our team hopes to help public transit planners by providing a free, user-friendly web application for analyzing PTNs based on publicly available GTFS data. Besides providing users with the ability to build aggregate networks from multiple transit types (e.g., combining Caltrain, BART, and Muni), Transitcat also makes it easy to visualize them and understand real-world usability through the use of isochrone maps. We're just three cat lovers hoping to improve the world, one public transit stop at a time.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/meow-logo%20-%20Aaron%20Michael%20Aquino.png",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Transitcat",
      "summary": "A free web application for urban planners that facilitates creating and analyzing public transit networks based on open GTFS data.",
      "team_members": "Aaron Aquino, Tracey Lin, Erik Raucher",
      "team_name": "Team Me0w"
    },
    {
      "class": "CS194",
      "description": "Our app takes advantage of a live listening feature which allows people to listen in-sync, to the same song, no matter where you are, to capture the natural way we like to share and experience music. We seamlessly integrate your spotify playlists into our app so you can share and add to your library with unprecedented ease. In doing so we strive to take the human element of music discovery and allow you to level emotionally and share a moment in time with friends and family all over the world. We have also developed our own Music Stories, which allows you to select 15 second clips of songs you have heard, and share them with your fanbase for a 24 hour period. This allows you to display your musical journey through a day, whilst also placing all the fresh new songs your friends have heard that day at your fingertips..",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/icon%20-%20Rohan%20Reddy%20Challa.png",
      "placement": "Music & Social",
      "project_name": "we:fm",
      "summary": "Listen to music together again",
      "team_members": "Seb Goddijn,  Amit Schechter, Abiel Gutierrez, Rohan Challa"
    },
    {
      "class": "CS191",
      "description": "IBD patients have higher psychological distress, poorer quality of life, less interpersonal support and greater reliance on passive coping strategies compared to controls. Online health communities/forums have become increasingly popular resources. Online community forums are an understudied, large and rich repository of patient experiences and information that can help us understand patient priorities and concerns over time. In this project, we use topic modeling analysis to discover common themes that come up in the forums.",
      "placement": "Health & Biomedical",
      "project_name": "Identifying Unmet Needs in IBD Patients: Topic Modeling Analysis of Online Community Forums",
      "summary": "Identifying Unmet Needs in IBD Patients: Topic Modeling Analysis of Online Community Forums",
      "team_members": "Robert Lerrigo, MD\nSid Sinha, MD\nJohnny Coffey\nJoshua Kravitz"
    },
    {
      "class": "CS210",
      "description": "Operation XRAY aims to engage the Free and Reduced Lunch (FRL) student who has no access to any computer science curriculum or does not perceive computer science as “for them.” \n\nWe worked with schools in East Palo Alto with over 85% students of color. In a recent study, only about 49% of Hispanic students said they knew an adult who works with computers or technology. There seems to be two major problems at hand: access to CS material and interest in the field. We felt that there are a variety of existing initiatives designed to address the issue of access, and a software project is not a satisfactory solution toward this end. Thus, Operation XRAY focuses on growing students’ interest and sense of belonging in CS.\n\nXRAY captures the interests of students while they're using websites such as Youtube, Facebook, and Twitter by exposing them to interactive in-app modules that reveal what's going on behind-the-scenes. The modules are retrofitted to cater to each student’s unique interest with themed lesson plans, and cover concepts from basic SQL to arrays & control flow.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/HackEd%20-%20Catherina%20Yue%20Xu.png",
      "placement": "Education",
      "project_name": "HackEd: Operation XRAY",
      "summary": "A chrome extension that exposes students to computational mindsets by surfacing the inner workings of websites they love",
      "team_members": "Catherina Xu, Michelle Lam, Angela Kong"
    },
    {
      "class": "CS194",
      "description": "We have built an augmented reality version of the popular arcade game Pacman. Game environments are generated procedurally from geolocation data, providing a view that is globally consistent across multiple users. We leverage the React Native framework to create a cross-platform experience, with Python servers supporting the backend. Furthermore, we used Viro React which provides a developer platform for rapidly deploying AR/VR applications.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/whirlLogoF%20-%20Jared%20Michael%20Crawford.png",
      "placement": "Games & VR/AR",
      "project_name": "Whirl",
      "summary": "Leverage advancements in AR/VR phone tech in new ways to make an immersive cross-platform game.",
      "team_members": "Alex Seutin, Curtis Ogren, Elliott Jobson, Jose Suarez-Rodriguez, Jared Crawford"
    },
    {
      "class": "CS210",
      "description": "Our project streamlines the process of searching and sharing of information concerning human rights violations. Organizations in this space lack technical tools to automate the process of information sharing/searching, causing these to be largely manual processes. The platform allows for 1) channeling of useful information from a variety of sources to governing bodies such as the UN and 2) efficient sorting and organization of this information. The former provides massive cost savings and the latter provides massive time savings for organizations. This platform also enables large governing bodies to maintain collaboration networks in a centralized manner. Due to the cost and time savings of our platform, organizations can focus their efforts instead on important tasks which cannot be automated, therefore allowing them to more efficiently address cases of crimes against humanity.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/soteria%20logo%20(1)%20-%20Anika%20Raghuvanshi.png",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Soteria",
      "summary": "Our project streamlines the process of evidence searching and sharing for human rights organizations and governing bodies.",
      "team_members": "Anika Raghuvanshi , Meena Chetty, Anna Carroll",
      "team_name": "Soteria"
    },
    {
      "class": "CS194",
      "description": "More and more people are interacting with recipes online instead of in print, but the layout and structure of recipes hasn't evolved along with the growth of technology. Chefs of all levels often want to be able to view and interact with an interface that is simple, and easy to navigate. Chef++ brings a database of thousands of recipes into an updated format that breaks up large portions of text that make it difficult to get information from a quick glance. With a visual timeline of instructions and options to view each step individually or a traditional list, using Chef++ in the kitchen makes following a recipe easier than ever.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/SansSerifLogo-v2%20-%20Heather%20Kramer.png",
      "placement": "Consumer",
      "project_name": "Chef++",
      "summary": "Chef++ brings traditional recipes into an interactive format that makes following along in the kitchen simple and straightforward.",
      "team_members": "Grant Sivesind, Hayk Tepanyan, Heather Kramer, John Nguyen, Mitchell Mendoza"
    },
    {
      "class": "CS191",
      "description": "Music is something we can't live without. It defines our personalities, forms lasting friendships, and helps us fulfill meaningful and emotional connections. Yet, there's no easy or intuitive way to meet people with similar music interests or compare your music to your friends'. Duet aims to solve this problem by analyzing users' music tastes, calculating compatibility scores between users based on Spotify listening data, and providing a platform to connect people with high music compatibility.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/38632231-f14cc398-3d70-11e8-880e-eeddc3fb43ea%20-%20Quinton%20Norman%20Wessells.png",
      "placement": "Music & Social",
      "project_name": "Duet",
      "summary": "social network based on music compatibility",
      "team_members": "Quinton Wessells, Rohan Bais, Lewin Cary, Rifath Rashid, Alex Fu"
    },
    {
      "class": "CS191",
      "description": "Users with gmail(Stanford) accounts can log into EventMap and see ongoing club events around on map. Users can also create or join clubs on EventMap to create events, invite other people to their events, or receive notifications about the events that are created by other club members.",
      "placement": "Music & Social",
      "project_name": "EventMap",
      "summary": "Discover fun Stanford club events around you.",
      "team_members": "Jinglin Shan (myself), James Landay (my faculty sponsor)"
    },
    {
      "class": "CS210",
      "description": "Securities are a topic of concern in the cryptocurrency space, as exchanges cannot legally list any token that can be classified as a security (ie backed by physical assets such as real estate). Solvence is a securities exchange for accredited investors only that aims to embrace the regulatory hurdles by restricting and actively maintaining knowledge around who uses our platform. Using a machine learning based \"Know Your Customer\" pipeline and a performant exchange infrastructure, Solvence hopes to list a sample of tokens that no exchange currently can.",
      "placement": "Blockchain",
      "project_name": "Solvence Securities Exchange",
      "summary": "Solvence is a securities exchange for cryptocurrencies. It aims to match buyers and sellers of securities tokens that cannot be listed on the current slew of crypto-exchanges.",
      "team_members": "Jeff Zoch, Pierce Freeman, Geoffrey Angus, Sam Eckert",
      "team_name": "Solvence"
    },
    {
      "class": "CS191",
      "description": "Neural machine translation (NMT) has seen large promise over traditional statistical methods for grammatical error correction, but both have a large data problem -- there is a lack of parallel data. We deployed a NMT system online called Crio that aims to overcome these shortcomings through new advancements in generating parallel data. My task revolved around adapting the model to the email domain by introducing new email data and trying various domain adaptation techniques and architectures to improve email editing experience for our users. We trained on a set of my Stanford emails as well as the Enron email dataset, in conjunction with existing large corpuses of non-email parallel data. Results are still in the works, but we are hoping to integrate a domain adapted model to the user depending on the website and the style of writing they use, and this is a start in the right direction towards that goal.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/Small%20Promotional%20Tile%20-%20Nathan%20Hitesh%20Dalal.png",
      "placement": "ML & NLP & CV",
      "project_name": "Crio",
      "summary": "We've been working on a Chrome extension, Crio (crio.stanford.edu), that uses neural machine translation to correct user grammar and provide feedback on Gmail. My project involved adapting trained models to better support users writing emails.",
      "team_members": "Nathan Dalal (191 student)\nZiang Xie, Stanley Xie, Joseph Lee (lab mates)",
      "team_name": "Crio"
    },
    {
      "class": "CS191",
      "description": "\"Stage Noir\" is a puzzle-exploration game which uses 6 degrees-of-freedom movement as a primary game mechanism. Inspired by game series like \"Professor Layton\" and \"The Curse of Monkey Island\", it's a unique experience that takes advantage of the ability to walk around a scene in physical space. The player interacts with a 3D world, reveals clues, and solves puzzles in order to immerse themselves in a mystery stretching themed regions, a hundred puzzles, and a man's struggle to reunite with his lost animal.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/StageNoirLogo%20-%20Andrew%20Soohwan%20Lee.png",
      "placement": "Games & VR/AR",
      "project_name": "Stage Noir",
      "summary": "Puzzle-exploration game using ARKit and 6DOF tracking.",
      "team_members": "Andrew S. Lee"
    },
    {
      "class": "CS194",
      "description": "TrustHat uses a social network of news sources that trust each other to create \"chains of trust\" between larger and smaller organizations. TrustHat provides these sources an embeddable icon for their websites to show their own chains of trust. Furthermore, users can use the TrustHat Chrome Extension to get information about the news sources that they are visiting.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/trusthat%20-%20Rhea%20Bryce%20Pokorny.png",
      "placement": "Consumer",
      "project_name": "TrustHat",
      "summary": "TrustHat combats fake news by giving users immediate information about the sources they are reading.",
      "team_members": "Rhea Pokorny, Adam Rosenberg, Yianni Laloudakis"
    },
    {
      "class": "CS191W",
      "description": "This study constitutes the first systematic and quantitative analysis of pump and dump manipulation schemes in cryptocurrency markets. We correlate \"pump and dump\" announcements made in semi-private group chats to positive short-term returns and increased trading volume in the cross currency pair associated with the announcement at a 99% confidence level. We find evidence that pump and dumps orchestrated on thinly traded virtual currencies break down typical correlations in the price and volume time series. We present lagged regression and autocorrelation models to explain virtual currency markets under idiosyncratic demand.",
      "placement": "Blockchain",
      "project_name": "Price Manipulation in Cryptocurrency Markets",
      "summary": "This study constitutes the first systematic and quantitative analysis of pump and dump manipulation schemes in cryptocurrency markets.",
      "team_members": "Matthew Das Sarma"
    },
    {
      "class": "CS191",
      "description": "We created this system in order to be able to collect large amounts of data from remote workers on Amazon Mechanical Turk. The largest challenge was building a system that could reliably stream video to users, even under poor network conditions. We use Google's WebRTC C++ implementation to create a WebRTC Python wrapper, and we simulate a grasping and manipulation environment with MuJoCo. The iPhone app and browser-based viewer both use the WebRTC standard to communicate with our server. From here, hopefully we will be able to collect many MTurk demonstrations and train an agent from them.",
      "placement": "Autonomous Systems & ML",
      "project_name": "Real-time Robot Simulation",
      "summary": "System to remotely simulate a robot on a GPU cloud server. Users can use a phone and browser to connect to, watch, and control a robot in real time.",
      "team_members": "Max Spero",
      "team_name": "Crowd and Cloud Robotics"
    },
    {
      "class": "CS210",
      "description": "Aerie Technologies empowers emergency responders with an aerial intelligence platform to provide ground truth in unpredictable and evolving environments. \n\nOur Orion platform manages an autonomous, elastic fleet of drones to collaboratively map massive areas. Our unique approach lets responders deploy surveying missions faster than conventional methods, providing timely insights when they matter most.\n\nOrion gives first responders improved situational awareness through three-dimensional composite models and a bird's eye view with high-resolution video. Whether coordinating rescue efforts, identifying vulnerable structures, or distributing aid, Orion is ready to be your eyes in the sky.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/aerie-tech-banner%20-%20James%20Michael%20Carroll.png",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Aerie-Technologies",
      "summary": "Empowering first responders through real-time situational awareness.",
      "team_members": "James Carroll, Travis Lanham, Adam Mosharrafa, David Slater, Sara Valderrama"
    },
    {
      "class": "CS191",
      "description": "This is an IOS application that allows for location-based forums. They will allow users to be able to make their own “rooms” or threads, and discuss various topics that happen on campus. For instance, each dormitory on campus can make their own rooms, allowing for community members to post and comment on dorm activities. This application will hopefully encourage open dialogue on campus, as well as creating an easy way for people to tune into “rooms” that they are interested in, such as intramural sports, social dances, classes, etc. This project uses Swift, as well as using Firebase for a backend implementation.",
      "placement": "Music & Social",
      "project_name": "Room",
      "summary": "A mobile application that allows users to anonymously make geo-based rooms relevant to a topic and post and comment in those rooms.",
      "team_members": "Batuhan Balci, Rick Duenas, Thomas Jensen, Conner Smith, Frank Zheng"
    },
    {
      "class": "CS210",
      "description": "In the context of high profile hacks in recent times (Tesla 2016, 2017; Jeep 2015), it is believed that cybersecurity is one of the biggest challenges towards wide adoption of connected autonomous vehicles.\nSeeR is applying deep learning methods to protect the new generation of powerful Electronic Control Units (ECUs) in such vehicles. We present the \n- SeeR Monitor: a platform for generating packet trace datasets and testing models against attacks; and the\n- SeeR Method: an end-to-end deep-learning based anomaly detection model that classifies incoming packets as malicious or benign in real-time.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/seer-logo%20-%20Pratyaksh%20Sharma.png",
      "placement": "Systems & Security",
      "project_name": "Seer",
      "summary": "Deep learning powered cybersecurity for cloud-connected automobiles",
      "team_members": "Sarah Tollman, Alan Flores-Lopez, John Kamalu, Karan Singhal, Pratyaksh Sharma"
    },
    {
      "class": "CS210",
      "description": "Scribble is a native iOS application that uses handwriting-to-text technology for easy keyboard input in virtual reality experiences. A user traces letters and words out on their iPhone screen, and sees them materialize in the virtual world. In order to experience Scribble and all its features, we invite users to try out Stormi - a virtual reality application built in Unity that enables collaborative brainstorming, with the help of sticky notes and cork boards. Using Scribble and Stormi in unison, users can enjoy a new type of interactive control in virtual reality -- one that's portable, and accessible through nothing but a smartphone.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/logo%20-%20Nishtha%20Bhatia.png",
      "placement": "Games & VR/AR",
      "project_name": "Scribble & Stormi",
      "summary": "Mirage is focused on creating an interactive language for virtual reality experiences of the future by placing control in the hands of your smartphone.",
      "team_members": "Chris Valadez, Kyle Qian, Nishtha Bhatia, Tariq Patanam",
      "team_name": "Mirage"
    },
    {
      "class": "CS210",
      "description": "Foresight has a slew of daily events over a range of categories (currently limited to sports, politics, and pop culture), in which people can predict the outcome and validate their predictive ability. Each event has an odds component which further stratifies pick results, as people with the \"foresight\" to make a stake on an underdog get rewarded more than those who pick a favorite; these odds are entirely crowd-generated, beginning at 1:1 for each of the 2 outcomes, and then changing and converging based on which outcomes users pick(i.e. after convergence, the expected value of picking the favorite and the underdog will be equal). For each event, the user has to pick an outcome as well as a percentage confidence they have on the outcome, and the confidence is the user's way of placing a varying stake on each event, as they'll be both rewarded and penalized more for indicating 100% confidence as opposed to 1%. Based on the accuracy of predictions, we compute a score for each user, with a time decay to incentivize frequent, recent picks, and then assign every user a percentile-based ranking, allowing them to see how their picking prowess compares to others.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/logo!%20-%20Neel%20Milind%20Bedekar.png",
      "placement": "Music & Social",
      "project_name": "Foresight!",
      "summary": "Foresight allows users to predict the outcome of arbitrary events in order to prove expertise in a topic, allowing them to compete against their friends and the world to find out who has the best predictive ability.",
      "team_members": "Neel Bedekar, Colin Dolese, Basel Al Sharaf, Akash Wadawadigi, Bill Kwai"
    },
    {
      "class": "CS210",
      "description": "Unshackled allows the public to capture and share video directly with law enforcement, opening up a direct channel of communication. Once a video report is sent to a law enforcement agency, our app enables real-time updates to civilians any time their case is updated by an officer. We increase transparency of law enforcement offices while at the same time decreasing their workload through automatic triaging of videos submitted. By enabling this streamlined communication, we aim to help strengthen the trust between the public and law enforcement.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/unshackled_logo%20-%20Reynis%20Heremi%20Vazquez-Guzman.png",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Unshackled",
      "summary": "Building trust between law enforcement and the public",
      "team_members": "Neil Movva, Miguel Garcia, Reynis Vazquez-Guzman"
    },
    {
      "class": "CS210",
      "description": "Satellite imagery is one of the most important tools for disaster risk management; it is cost-effective, frequently updated, and publicly available to countries that do not have their own remote sensing programs. However, getting started with satellite imagery can be a daunting and time-consuming task. Because of this barrier to entry, decision-makers in developing countries often opt to use antiquated and imprecise tools to inform their decisions rather than satellite data. \n\nTeam Orbit's Data Analysis Toolbox is a web application that makes working with satellite data faster and more intuitive. It allows users to immediately access and visualize some of the most important geospatial indices used in disaster risk management. Our application also allows users to upload and overlay their own data to aid their interpretation of the indices. We hope this tool will make geospatial analysis more accessible by reducing training time and allowing users to integrate satellite data into their decision-making processes.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/orbit-logo%20-%20Petar%20Bozhidarov%20Penkov.png",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Team Orbit's Data Analysis Toolbox",
      "summary": "A web application that aids disaster risk management by automating important satellite image analysis that would otherwise be time-consuming to perform.",
      "team_members": "Edouard Asmar,  Rebecca Bauer,  Petar Penkov, Guilherme Reis, Julia Truitt",
      "team_name": "Team Orbit"
    },
    {
      "class": "CS191",
      "description": "The Deluge binary protocol allows for applications running on low-power, embedded devices to be efficiently updated over wireless links. This project implemented the Deluge protocol on top of the Tock operating system, which is a research operating system written in Rust and designed to be a secure embedded operating system. This project allows for userland applications to be wirelessly updated, allowing Tock to be deployed in an embedded environment while enabling periodic updates to running applications. Implementing Deluge in Rust also highlighted several challenges in writing a secure and efficient wireless updating mechanism.",
      "placement": "Systems & Security",
      "project_name": "Wireless Updating for Embedded Applications",
      "summary": "This project implements the Deluge binary updating protocol on the Tock operating system, allowing for applications to be efficiently updated over low-power, wireless links.",
      "team_members": "Paul Crews"
    },
    {
      "class": "CS210",
      "description": "In order for a clinical drug produced by a pharmaceutical to get to a patient, it must pass through two intermediaries - the insurance provider, and a third party negotiator called a Pharmacy Benefits Manager. This third party originally developed out of necessity to negotiate deals between hundreds of pharmaceuticals and insurance companies. However, in the current day and age, PBMs are unnecessary and take a large proportion of profits in the drug pipeline (on the order of $300 billion). That's where Torque comes in - our end goal is to create a direct bidding marketplace for drugs between insurance companies and pharmaceuticals, so that both sides get the best deal sans PBM. In order to onboard self-insured employers, we have created an intermediary tool that shows them where exactly they are getting screwed over by PBMs - specifically in the field of speciality drugs. Our hope is that by finding self-insurers better deals for drugs with specialty pharmacies, we can take a step towards making healthcare more affordable in the United States.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/68747470733a2f2f692e696d6775722e636f6d2f7054536a4d366a2e6a7067%20-%20Akshay%20Ramkumar%20Ramaswamy.jpeg",
      "placement": "Health & Biomedical",
      "project_name": "Torque",
      "summary": "Torque is a tool for analyzing anonymized health insurance claims data, built to generate insights which enable self-insured employers to decrease their healthcare spend without compromising their coverage.",
      "team_members": "Akshay Ramaswamy, Belce Dogru, Jarrod Cingel, Michael Troute"
    },
    {
      "class": "CS191",
      "description": "Pointr is a satellite project developed as part of the student space initiative.  The purpose is to demonstrate the ability for a small satellite to steer and focus a laser beacon from the ground onto a sensor.  The project is motivated by interest in optical (laser) communications as a faster means of transferring data in space.",
      "placement": "Autonomous Systems & ML",
      "project_name": "Pointr",
      "summary": "Develop satellite software to point and track onto a laser ground beacon.",
      "team_members": "Orien Zeng"
    },
    {
      "class": "CS191W / ENGLISH198",
      "description": "This project attempts to find meaningful quantitative differences across Faulkner’s novels as divided across three major categorizations: early vs. middle vs. late novels, Yoknapatawpha novels vs. novels with other settings, and “higher-brow” vs. “lower-brow” novels. Using well-established methods in algorithmic criticism (including rudimentary metrics and tf-idf) as well as some original algorithms (including sentence complexity analysis and automated gender inflection tagging) this project sheds light on the relationship between a novel’s high-level reputation or character and its quantifiable textual features.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/faulkner-logo%20-%20Daniel%20Edward%20McFalls.jpg",
      "placement": "ML & NLP & CV",
      "project_name": "Reading Faulkner Quantitatively",
      "summary": "This project charts quantitative differences over meaningful categorizations of Faulkner's novels using a slew of algorithmic methods.",
      "team_members": "Dan McFalls"
    },
    {
      "class": "CS210",
      "description": "We aim to integrate voice commands to enable the use of a more natural XR Editor interface. We are focusing on asset and file lookup, which is a major pain point for video game designers. Specifically, we are looking to prototype a voice command plugin for Unreal Engine 4's VR editor. This involves creating a voice controlled asset lookup window, supporting a broad series of intents, and classifying objects.",
      "placement": "Games & VR/AR",
      "project_name": "Celestial",
      "summary": "Celestial is working on a project which will allow XR Editors to select, place, and modify content entirely via their VR environment.",
      "team_members": "Natalie Ng, Christina Ramsey",
      "team_name": "Celestial"
    },
    {
      "class": "CS194",
      "description": "DDOB (the Dharma Debt Order Book) is a web app and API that connects cryptocurrency debtors and creditors for peer-to-peer lending.  Our product leverages the Dharma protocol (https://dharma.io/) to host an orderbook of unfilled debt orders (in a manner similar to LendingClub) on our own database off the Ethereum blockchain, as is standard practice to limit costly transactions. On the debtor's end, the product offers a web interface for contract creation. For creditors, our order book supplies an API to post orders and a web socket that sends a notification on the creation of a new debt order along with a web interface to fill loans. Our service also offers an intuitive infrastructure to create an order-filling bot which can fill loans that meet user-specified criteria.",
      "placement": "Blockchain",
      "project_name": "Dharma Debt Order Book (ddob)",
      "summary": "A marketplace for peer-to-peer loans denominated in any ERC-20 cryptocurrency",
      "team_members": "Matthew C. Mahowald, Christopher M. Fernandes, Scott W. Morris, Alexander E. Haigh"
    },
    {
      "class": "CS210",
      "description": "Karel With Friends is a Facebook Messenger game that introduces players to computer science concepts as they write code to guide their character through various maze challenges. Starting with simple move instructions and adding conditionals, loops, and other control structures, players may not even realize they’re learning fundamental computer science concepts! Built using the Phaser Javascript web engine, we utilize the social sharing and competition aspects of the Messenger games platform to make Karel With Friends fun and engaging for middle and high school students. Our mission is to build a path to discover and explore computer science for everyone, particularly for students from underrepresented backgrounds who may not recognize their own programming aptitude. Through playing Karel With Friends, students discover that programming is fun, accessible, and a potential part of their future.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/CanoeLogo%20-%20Grady%20Dutch%20Williams.png",
      "placement": "Education",
      "project_name": "Karel with Friends",
      "summary": "Karel With Friends is a Facebook Messenger game meant to introduce middle and high school kids to computer science concepts! Using social challenges and fun maze puzzles, we hope to make computer science exciting and accessible, especially for students from underrepresented backgrounds.",
      "team_members": "Scott Kazmierowicz, Bryan McLellan, Vicki Niu, Stuart Sy, Grady Williams",
      "team_name": "Canoe"
    },
    {
      "class": "CS191",
      "description": "This project proposes extracting features from 3D scanned Roman capitals and evaluating their level of standardization under the constraints of a very small set of noisy data. I take preprocessed scans of eight capitals, find their bounding dimensions as simplifications of their forms, and create a linear weighted regression model that uses physical features specifying volume, symmetry, and erosion to represent each capital. Using a Pearson correlation metric to build a similarity matrix, the model successfully distinguishes the particularly eroded specimens, however the correlations are not very stable when computing similarities in increasing detail. I also run Principal Component Analysis (PCA) to reduce the feature vectors to two dimensions while maintaining variance in the data. Analyzing archaeological data is a more difficult and less objectively defined problem with lots of potential for improvement.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/Capital_example%20-%20Natalie%20Christel%20Muenster.png",
      "placement": "ML & NLP & CV",
      "project_name": "Marzamemi Capitals: 3D mesh analysis of sparse and eroded archaeological specimens",
      "summary": "3D mesh analysis of sparse and eroded archaeological specimens",
      "team_members": "Natalie Muenster"
    },
    {
      "class": "CS210",
      "description": "TowerCode is a mobile game designed to introduce programming concepts to high school students, especially those who may not have previously had the opportunity to learn. Our goal is to empower kids to realize the creativity involved in solving problems through coding, and to inspire a sense of confidence in their own ability to do so.",
      "logo_url": "https://raw.githubusercontent.com/cs210/fair-guide/master/src/images/2018/32506955_10204970997952414_949181746576883712_n%20-%20Tessera%20Chin.png",
      "placement": "Education",
      "project_name": "TowerCode",
      "summary": "A classic tower defense game with a twist: customize your own tower, or play with a friend and match your custom towers against their soldiers! You might even learn how to code along the way...",
      "team_members": "Michael Chung, Amy Liu, Isis Grant, Tessera Chin",
      "team_name": "Sova"
    },
    {
      "class": "CS210",
      "description": "Conjure is a verbal and gestural application for Unreal Engine 4 that makes VR development more intuitive and accessible for novice users. Powered by IBM Watson, Conjure allows users to edit a VR level using their voice and controllers while also receiving visual and audio feedback. Users have the ability to spawn, translate, rotate, and scale objects quickly and without frustration in a new and exciting fashion.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/Logo%20-%20Omar%20Solis.jpg",
      "placement": "Games & VR/AR",
      "project_name": "Conjure",
      "summary": "Conjure is an intuitive verbal and gestural interface for virtual and augmented reality world building. Using natural language processing, we empower our users to easily conjure their worlds into reality.",
      "team_members": "Grace Hong, Stephen Hitchcock, Omar Solis"
    },
    {
      "class": "CS194",
      "description": "Technology companies have continuously strived to better understand their people and conserve their talent, with limited success -- employee churn among tech companies is the highest in history. The resultant cost is significant: time and capital spent recruiting new talent, ramp-up costs for training, as well as the lost productivity during the replacement period. To combat this challenge we hope to bring to bear the power of data and machine learning to help companies better understand and control employee attrition & culture. Enigma is a comprehensive and insightful, yet easy-to-use human resource tools, fundamentally transforming the relationship between companies and their employees.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/Enigma%20-%20Ramin%20Ahmari.jpeg",
      "placement": "Consumer",
      "project_name": "Enigma",
      "summary": "Enigma leverages the power of data and machine learning to help companies better understand and control employee attrition & culture.",
      "team_members": "Rish Gupta, Dunchadhn Lyons, Freya Chay, Ramin Ahmari, George Preudhomme"
    },
    {
      "class": "CS191",
      "description": "Using RNN sequence generation, I built a tool that generates freestyle rap lyrics about a specific topic, in the style of a specific artist. Before embarking on this project, I was intrigued by how the human brain works to generate rap lyrics on the spot, and wanted to explore how to make a computer imitate this process. The tool aims to inspire curiosity and delight in those who watch it at work. As an aspiring educator, I'm passionate about the potential of tools like this for getting young people interested in technology. The journey of how I taught this program to rap is documented in a blog post, and the final product can be viewed on a web app.",
      "placement": "ML & NLP & CV",
      "project_name": "Freestyle: Creating Rap Lyrics with Recurrent Neural Networks",
      "summary": "This tool generates freestyle rap lyrics, using RNN sequence generation, about a specific topic and in the style of a specific artist.",
      "team_members": "Michelle McGhee, Chris Piech"
    },
    {
      "class": "CS191",
      "description": "Mood assumes the guise of a mental health app and prompts the user for their mental state each day. However, instead of creating practical visualizations of the data, the app generates moodscapes based on the data accumulated over a period of time. The project seeks to paint a gradual picture of the user's mental state, encouraging self-reflection without providing specific directions about how to do so. How might our inner minds look in times of joy or in times of stress?",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/appicon%20-%20Eric%20Yeon-An%20Huang.png",
      "placement": "Health & Biomedical",
      "project_name": "Mood",
      "summary": "Mood is an interactive experience that assumes the guise of a mental health app, generating visual moodscapes based on user mood entries over a period of time.",
      "team_members": "Eric Yeon-An Huang"
    },
    {
      "class": "CS191",
      "description": "I have built a fully automated system to converse in a closed-domain question-asking manner. To do this I built layers of abstraction on top of audio conversation to create a “conversational programming language”. By leveraging mature NLP/NLU tools I designed and implemented a novel “engine” that can traverse a probabilistic graph designed for each application. These abstractions enabled me to build an application that converses with individuals in a biographical manner- asking questions about their life, memories, and perspectives. These conversations are recorded and saved so that the user can share their biography with their friends and family.",
      "placement": "Consumer",
      "project_name": "A Novel Speech-Based Conversational Platform for Long Conversations",
      "summary": "A fully automated platform for closed-domain question-asking sustained conversations via phone calls.",
      "team_members": "Ryan McKinney"
    },
    {
      "class": "CS191",
      "description": "Legion is a programming system for distributed heterogeneous architectures, with a programming model designed around \"regions,\" which are logical representations of collections of data, and tasks that operate on regions. Legion currently requires application developers to manually specify assignments of tasks to machines and regions to machine memories. In this project, we implement an offline tool to simulate and search for optimal task and region configurations based on an application's execution log. These configurations can then be fed into the existing Legion runtime for real program executions. We also analyze the execution patterns and optimal configurations of several Legion applications.",
      "placement": "Systems & Security",
      "project_name": "Optimizing task allocation and data placement in the Legion programming system",
      "summary": "We implement a tool to search for optimal task and data configurations for the Legion parallel programming system.",
      "team_members": "Stephanie Chen"
    },
    {
      "class": "CS191",
      "description": "The idea is to evaluate the recommender system's impact on decision-making processes and behaviors of physicians. It is important to understand both the short-term and long-term implications of potential behavior change that such a system may induce in clinical decisions at point-of-care and how these changes may affect patient treatment plan costs and efficacy over time. Ideally, recommender systems will reduce variability in physician treatment of patients and make their plans converge to more accurate solutions based on the aggregate knowledge they will be provided by the system when treating each patient. This project is important in identifying whether these recommender systems will truly move physician behavior along the positive direction or whether there might be some unintended consequences in how the system begins to influence physicians’ decision-making, accuracy, and monetary and fiscal cost per patient.",
      "placement": "Health & Biomedical",
      "project_name": "Recommender Systems in Medicine",
      "summary": "An HCI study to evaluate the impact of recommender systems on physician behavior and treatment plans.",
      "team_members": "Divya Saini, David Morales"
    },
    {
      "class": "CS194",
      "description": "Our project is a web-based application that encourages users to make goals to follow good habits and stick to them. Example use cases might be personal fitness, meditation, or quitting bad habits. Users are able to add connections, which allows them to see what habits their friends are working to improve and create encouraging communities within the social network. The application also provides visualizations based on habit data so users can keep track of how they’re doing. The combination of the social and data aspects helps users pursue their habits more effectively.",
      "placement": "Health & Biomedical",
      "project_name": "A Social Habit Tracker",
      "summary": "A habit tracking web application that allows users to work on improving themselves while connecting with other users via photo-sharing and connections. The application also provides visualization to give users feedback on how well they are following their habits.",
      "team_members": "Amy Shen, Jeff Pyke, Jennifer Tao, Kevin Baichoo, Peter Do",
      "team_name": "Team Rocket"
    },
    {
      "class": "CS191",
      "description": "Plato is a chatbot designed as a supplement to John Etchemendy's \"Language, Proof, and Logic\" textbook, and students will be able to practice converting natural language sentences (\"If A is a cube, then it is small.\") into their logical form (\"cube(A) => small(A)\"). These types of translation problems have traditionally been assigned as textbook problems, but using the Plato chatbot, students can get used to first-order logic at their own pace in a low-pressure, fun learning environment. Plato is designed so that the problems become increasingly difficult as the student gets more practice, and the instructors can choose different forms of error feedback. In addition, we employ an encoder-decoder neural network for students to test out their own natural language sentences.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/plato%20-%20Jeffrey%20Kenichiro%20Hara.jpg",
      "placement": "Education",
      "project_name": "Plato: a dialog for learning first-order logic",
      "summary": "Developed at the Center for the Study of Language and Information, this is a chatbot designed for students using John Etchemendy's \"Language, Proof, and Logic\" textbook to practice learning how to convert language into first-order logic. Plato's chatbot design is meant to casually encourage learning at the student's own pace, and we use neural networks to generate problems for the students.",
      "team_members": "Jeff Hara"
    },
    {
      "class": "CS 199",
      "description": "SoundFyre is a music streaming web app that enhances the visibility and discovery of underground artists. Our app relies on geolocation data to streamline users discovery and listening experience. With neat visualization and artists' portfolio, SoundFyre lets artists shine their brightest.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/logo%20-%20Robel%20Eneyew%20Mengistu.png",
      "placement": "Music & Social",
      "project_name": "SoundFyre",
      "summary": "SoundFyre is a music streaming web app that enhances the visibility and discovery of underground artists.",
      "team_members": "Oluwasanya Awe, Gerry Meixiong, Robel Mengistu, Vikram Sreedhar",
      "team_name": "SoundFyre"
    },
    {
      "class": "CS191",
      "description": "A central feature of American life, the commute has been characterized by designers and physicians as a valuable yet wasted period of time for mental health intervention. For our project, we sought to expand the existing framework of the PopBots Therapeutic Micro-Chatbots to include improved turn-taking and back-channeling in conversation. We ran a series of in-car experiments to test user responses to different conversational styles and features within the conversation. We collected this data for both improved user design and prosody and sentence-structure analysis for turn-taking prediction.",
      "placement": "Health & Biomedical",
      "project_name": "The Mobile Therapist: Designing Therapeutic Chatbots for the Commute",
      "summary": "A novel exploration of the commute as therapy. We evaluate the use of voice-based therapeutic chatbots in the car through user experience testing and data collection for natural language processing.",
      "team_members": "Julia Alison, Shannon Wu"
    },
    {
      "class": "CS194",
      "description": "The Internet has made the world smaller: it’s easier than ever to contact people regardless of where they are (as long as they have internet connection). \nHowever, there is a gap in the market for tech that brings people together and allows ideas to be shared in an expressive, dynamic and interactive way. We believe that social media has liberated self-expression, but the experience itself is insular and self-focused. With Redthread, we aim to emphasize the intellectual and artistic profile of a person, not their physical appearance. Currently, Redthread is a collaborative text mind-mapping platform. In the future, we want to emphasize network discovery based on mutual collaborations and eventually extend the platform to allow individuals to seek other talent within their social networks with whom to collaborate and learn from and be inspired by other creative minds. We see Redthread as the future of social media, providing not just utility, but also overall social good in its new emphasis on the creative and collaborative.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/logo%20-%20Harper%20Carroll.png",
      "placement": "Music & Social",
      "project_name": "Redthread",
      "summary": "a socially collaborative mind-mapping platform",
      "team_members": "Mitchell Pleus, Petra Grutzik, Auden Ehringer, Leilani Reyes, Harper Carroll"
    },
    {
      "class": "CS191",
      "description": "We investigated the accuracy of using a pretrained discriminator as a classifier over real/fake images from a GAN. The discriminator used in training the GAN was unable to distinguish real images from fake images. We then trained a superior discriminator that can perfectly classify real/fake images. We packaged this superior discriminator into a Chrome plugin, to serve as an example of AI-security tools we believe will become ubiquitous in the next few years.",
      "placement": "ML & NLP & CV",
      "project_name": "Restoring Trust: Learning to Detect GAN-Generated Images",
      "summary": "By training a superior discriminator, we are able to classify certain classes of images as real or GAN-generated with close to 100% accuracy. Further research into this area will be critical to building tools that alert people when they are viewing fake content.",
      "team_members": "Benjamin Penchas"
    },
    {
      "class": "CS191",
      "description": "We propose Generative Adversarial Tree Search (GATS), a sample-efficient Deep\nReinforcement Learning (DRL) algorithm. While Monte Carlo Tree Search\n(MCTS) is known to be effective for search and planning in RL, it is often sample-\ninefficient and therefore expensive to apply in practice. In this work, we develop a\nGenerative Adversarial Network (GAN) architecture to model an environment’s\ndynamics and a predictor model for the reward function. We exploit collected\ndata from interaction with the environment to learn these models, which we then\nuse for model-based planning. During planning, we deploy a finite depth MCTS,\nusing the learned model for tree search and estimated Q-value for the leaves, to\nfind the best action. We theoretically show that GATS improves the bias-variance\ntrade-off in value-based DRL. Moreover, we show that the generative model learns the model dynamics using orders of magnitude fewer samples than the Q-learner. In non-stationary settings where the environment model changes constantly, we find the generative model adapts significantly faster than the Q-learner to the new environment.",
      "placement": "Autonomous Systems & ML",
      "project_name": "Sample-Efficient Deep RL with Generative Adversarial Tree Search",
      "summary": "We propose Generative Adversarial Tree Search, a sample-efficient Deep Reinforcement Learning algorithm which exploits the benefits of model-free and model-based learning.",
      "team_members": "Brandon Yang"
    },
    {
      "class": "CS191",
      "description": "We use different computer vision techniques to train ad-logo detection models. We then identify algorithms that generate adversarial examples for these perceptual ad-blocker systems.",
      "placement": "ML & NLP & CV",
      "project_name": "Perceptual Ad-Blocker",
      "summary": "We study adversarial examples for perceptual ad-blockers.",
      "team_members": "Gili Rusak"
    },
    {
      "class": "CS194",
      "description": "Our virtual arcade is built for PC, and was made in Unity and C#, with one main hub world that can transport the player to and from different mini-games. There is a snake-like \"106A\" game, three bit-wise \"107\" games,  a \"107\" inspired asteroids game, \"109\" inspired graph game, and two \"110\" inspired games. Each game is an homage to a certain topic of the Stanford CS core, which was a large part of our lives here. From Karel the Robot to a resounding \"Makes Sense\", Motherboards on Fire is a fun way for Stanford CS seniors to take a trip down (random access) memory lane.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/motherboards_on_fire%20-%20Brandon%20Alessio%20Huelga.gif",
      "placement": "Games & VR/AR",
      "project_name": "Motherboards on Fire",
      "summary": "To celebrate and reflect on our time in Computer Science at Stanford, we have created a Unity-made virtual arcade of mini-games that represent the core classes of CS.",
      "team_members": "Robert Neff, Brandon Huelga, Michael Arruza, Charlotte Munger, Ryan Smith",
      "team_name": "Motherboards on Fire"
    },
    {
      "class": "CS194",
      "description": "We are looking to integrate a personalized morning experience into your everyday mirror. Reflection, the product, is a two-way mirror with an attached LCD screen, fitted into a wood frame. The product is cohesive (includes both the hardware and the software), and the LCD system can display a wide variety of customizeable information, such a calendar, weather report, local traffic report, a music player and more! Product also comes with a corresponding phone app, allowing for personalization of a given smart mirror interface for any given user. Wake up, and get ready in front of Reflection with all the information and entertainment you need to have a fun and productive day.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/68747470733a2f2f692e696d6775722e636f6d2f7542664e7873432e706e67%20(1)%20-%20Marcus%20Vincent%20Gomez.png",
      "placement": "Consumer",
      "project_name": "Reflection",
      "summary": "Customizable full-scale smart mirror solution, providing both the hardware and corresponding software for creating the best personalized experience possible",
      "team_members": "Marcus Vincent Gomez, Rodrigo Grabowsky, Tyler Dammann, Connor Normand, James Lyons"
    },
    {
      "class": "CS194",
      "description": "We wanted to create a Chrome extension that allowed users to look at suggested reading materials at their convenience. We decided to analyze users' browsing data to come up with suggestions because this data is readily available and requires no input from the user, thereby streamlining the process of obtaining recommendations. We present the user with a variety of media: in particular books, articles, and videos.",
      "placement": "Consumer",
      "project_name": "Topic Tree",
      "summary": "A Chrome extension to suggest books, articles, and movies based on the user's browsing data.",
      "team_members": "James Ortiz, Jason Chen, Eliza Klyce, Coleen Holden, Juan Grau"
    },
    {
      "class": "CS194",
      "description": "There are about 400,000 domestic helpers in Hong Kong. Many of these domestic helpers are exploited by the employment agencies that placed them or are abused by their employers. Many of the risky placements that domestic helpers find themselves in can be prevented with better data analytics. We are building one centralised platform which agencies can use to store placements and the Philippine consulate can use to approve placements. In addition, we built an agency mapper tool so that helpers, employers and the public in general can use to search for and avoid suspicious agencies.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/Main%20Logo%20-%20Jaime%20Sebastian%20Deverall.png",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Tala",
      "summary": "We are building tools to aid non-profits and the Philippine consulate in Hong Kong to combat modern-day slavery.",
      "team_members": "Jaime Deverall, Miguel Ayala, Theodore Ford, Pascal Cevaer-Corey, Jonah Bolotin",
      "team_name": "Tala"
    },
    {
      "class": "CS194",
      "description": "The application scrapes Google News and identifies the top X positive-scoring articles based on artificial intelligence models. We use a model that takes in the words as features and uses the collective TFIDF-weighted value sum of all the words to output this score.",
      "placement": "Consumer",
      "project_name": "The Pursuit of HappyNews",
      "summary": "The Pursuit of HappyNews is a news aggregator that delivers you positive news articles from the web.",
      "team_members": "Cortlandt Bursey-Reece, Minh-An Quinn, Lincoln Valdez, Kalvin Wang"
    },
    {
      "class": "CS194",
      "description": "RxRadio is an iPhone app that integrates with Spotify to help create more personable playlists. RxRadio takes your artists and interests to create a playlist customized to you. After submitting an interest/activity and a degree of separation, RxRadio will give you a phenomenal playlist. Users also have the option to select which artists are used in the playlist. All playlists are created and accessible within your Spotify account.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/RxRadio%20-%20Matthew%20Brandon%20Daniel.png",
      "placement": "Music & Social",
      "project_name": "RxRadio",
      "summary": "A more personalized playlist creator.",
      "team_members": "Jose Saldaña, Omar Sow, Marissa Werts, Matthew Daniel, Samuel Mignot",
      "team_name": "JOMMS"
    },
    {
      "class": "CS194",
      "description": "Shopalot is a platform primarily for helping physical stores create an online presence. In doing so, this enables users to browse local quality products made by local artisans and small retailers who do not have online stores or websites. Shopalot, however, is not a platform for purchasing goods; rather, the platform provides an interface for users simply to browse local products, thus giving them a better idea of which stores near them they would like to visit -- this can bring more business to local shops. Shopalot also provides an easy-to-use inventory management system for artisans and retailers who have small physical stores with ledgers or out-dated methods of inventory management.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/shopalot%20-%20Scott%20Mallery%20Buckstaff.png",
      "placement": "Consumer",
      "project_name": "Shopalot",
      "summary": "Shopalot is a way for you to find local artisans and retailers who lack an online presence. For artisans and retailers, Shopalot provides an easy-to-use inventory management system.",
      "team_members": "Scott Buckstaff, William Bakst, Linus Meyer-Teruel, George Pakapol Supaniratisai, Pakapark Nik Bhumiwat",
      "team_name": "Shopalot"
    },
    {
      "class": "CS194",
      "description": "We partnered with the MUSIC 146J class to interview artists, and retrieved demographic information from the American Community Survey by the US Census. To plot nearby arts nonprofits, we used data from the IRS Master Business Files, cross-referencing with data from Guidestar to show only performing arts-related organizations. We tagged the organizations by hand so that users can show only organizations related to a particular culture or performing art type. Finally, we used the Leaflet and React javascript libraries to plot this data on a map. In the final product, a map appears with clickable pinpoints showing the video interviews, and a side panel gives info about the visualization along with controls to interact with demographic information and various surrounding arts organizations.",
      "placement": "Public Policy & Government & Nonprofits",
      "project_name": "Moose",
      "summary": "Moose is an interactive map offering a high-level view into music and arts organizations in the Bay Area. Explore interviews with artists as well as demographic factors and nearby organizations that influenced their work.",
      "team_members": "Ryan Eberhardt, Sonja Johnson-Yu, Chris Swenson, Francisco Izaguirre"
    },
    {
      "class": "CS191",
      "description": "Unsupervised representation learning is the task of mapping high-dimensional data, like images, videos, and sentences, into lower-dimensional vectors which capture the semantic content of this data. We approach this problem by training two networks in a simple collaborative game. In this game, an embedding network must produce representations that enable an identifier network to tell which object was seen by the embedding network.",
      "placement": "ML & NLP & CV",
      "project_name": "Unsupervised Representation Learning via Collaborative Games",
      "summary": "Learn unsupervised representations by forcing two neural networks to work together in a collaborative game",
      "team_members": "Alex Tamkin"
    },
    {
      "class": "CS194",
      "description": "Ari is particularly useful for people with limited access to career development resources, for instance people with varying educational backgrounds/proficiency in English, or even high school students looking for part-time jobs. Ari is developed in React Native / Python server backend and firebase storage. Ari provides a simple chat interface for users to discuss their career goals, objectives, skills, experiences and developmental pathway as well as a job recommendation platform. Resume is presented to the user as a downloadable link which can be used to apply to the job of their choice.",
      "logo_url": "https://github.com/cs210/fair-guide/raw/master/src/images/2018/ari_logo%20-%20Samir%20Sen.png",
      "placement": "Consumer",
      "project_name": "Ari",
      "summary": "Ari is a smart, personal coach who can help you build a professional resume based on your skills and achieve your career goals.",
      "team_members": "Samir Sen, Thao Nguyen, Meera Srinivasan, Krishna Patel"
    },
    {
      "class": "CS191",
      "description": "We integrate somatic variants, DNA methylation, and copy number alteration to identify a network of mutually exclusive aberrations in chromatin related genes in the TCGA KIRC cohort.  Central to the mutual exclusivity network is the epigenetic silencing of BAZ2B, whose role in the ISWI chromatin remodeling complex has not been well defined.  We find that the epigenetic silencing of BAZ2B is associated with significant down-regulation of expression across the genome and that this silencing is enriched for metastasis suppressor signatures TIMP2 and KISS1.  Both in TCGA and an independent validation cohort, we find that the expression of BAZ2B is associated with metastatic outcome and worse progression-free survival.",
      "placement": "Health & Biomedical",
      "project_name": "Integrative Analysis of Chromatin Modifiers in KIRC",
      "summary": "I used network theory to analyze patterns of mutual exclusivity in the genomic landscape of kidney cancer and identified a candidate epigenetic biomarker.",
      "team_members": "Kaitlyn Lagattuta"
    },
    {
      "class": "CS191",
      "description": "With over 2 billion examinations performed yearly in the U.S. alone, chest radiographs are the primary method for routine screening upon hospital admittance and for detecting thoracic diseases, many of which are among the leading causes of mortality worldwide. Even though there is an abundance of chest imaging data, only two publicly available chest radiographic image datasets contain more than 5,000 images. \nWe present the largest chest radiograph dataset to date, which contains ternary labels (certainly present, certainly absent, and uncertain) for 12 pathologies. The labels are extracted using an improved rule-based system.\nWe hope that making this data publicly available will speed the advancement of machine learning for radiology.",
      "placement": "Health & Biomedical",
      "project_name": "Constructing a Massive Dataset of Chest X-Ray Images",
      "summary": "We release this dataset to address the lack of publicly available large, high-quality medical imaging datasets: our dataset, the largest of its kind to date, consists of 240,000 frontal-view and lateral-view chest radiographs retrospectively obtained from the Stanford Hospital, labeled using a rule-based system for 12 clinically relevant pathologies extracted from the radiology report that corresponds to each radiograph.",
      "team_members": "Silviana Ciurea-Ilcus (as part of a larger research group consisting of Jeremy Irvin, Yifan Yu, and Pranav Rajpurkar)"
    },
    {
      "class": "CS191",
      "description": "Historically, the design and development of major popular programming languages has been guided or dictated by one entity -- be it ISO, Guido van Rossum, Kernighan & Ritchie, or others. In this project, we have a unique view into the community of Rust users for which language design has been democratized; with this perspective, we can begin to understand and evaluate methods of ergonomic programming language design.",
      "placement": "Systems & Security",
      "project_name": "Understanding Rust: The Language and its People",
      "summary": "An analysis of the successes and learnings of language design driven by an entire online open source community",
      "team_members": "Anna Zeng"
    },
    {
      "class": "CS191",
      "description": "The Rocket Template Engine (RTE) makes extensive use of Rust's procedural macro API to compile template files into executable Rust code that can render the template. RTE introduces a compiler extension that points compilation errors (derived from the embedded Rust) directly into the source of template file, even though it is not a traditional .rs source file. This makes debugging templates easier and more intuitive than any other templating engine in Rust. RTE allows almost any Rust expression and statement to be embedded in its template and supports many-level inheritance using Jinja-inspired semantics and syntax.",
      "placement": "Systems & Security",
      "project_name": "Rocket Template Engine",
      "summary": "A fast Jinja-inspired template-rendering engine written for Rust.",
      "team_members": "Divyahans Gupta"
    },
    {
      "class": "CS191",
      "description": "A common subroutine in distributed estimation algorithms is linear averaging, in which each sensor in a network has some scalar-valued reading, and all the sensors must agree on the average reading across the network through only local communications. The standard way this is done is through the Linear Consensus Protocol (LCP), in which each sensor iteratively updates its value to a convex combination of its own and its neighbors values. The convergence speed of the LCP depends on the weights in these convex combinations, and finding the optimal weights for fast convergence for a given network is an important optimization problem. Xiao and Boyd (2006) show how to solve this problem globally using semidefinite programming. In this project, I look at variants of the core problem of fast LCP convergence, and also look at ways to solve the optimization problem in a distributed manner.",
      "placement": "Autonomous Systems & ML",
      "project_name": "Fast Distributed Sensor Estimation via Semidefinite Programming and Local Spectral Algorithms",
      "summary": "A standard iterative algorithm in multi-robot systems and sensor networks is the Linear Consensus Protocol (LCP), and getting LCP to run robustly and converge fast yields interesting network optimization problems. In this project I use tools from semidefinite programming and spectral graph theoretic algorithms to solve these optimization problems.",
      "team_members": "Pranav Sriram"
    },
    {
      "class": "CS191",
      "description": "Currently, coaches evaluate potential recruits’ transcripts on paper and by hand. To streamline this tedious process, TreeSearch allows images of transcripts to be uploaded on a web application, accessible to coaches, to be annotated. The application also allows for interactive updating of recruits’ profiles.",
      "placement": "Consumer",
      "project_name": "TreeSearch",
      "summary": "TreeSearch streamlines coaches’ recruiting process by providing an interactive web application to view recruit info and transcript info.",
      "team_members": "Kali Cornn"
    },
    {
      "class": "CS191",
      "description": "We collected and labeled an appendicitis dataset in collaboration with Stanford hospital, analyzed it for biases, and developed a model for appendicitis detection.",
      "placement": "Health & Biomedical",
      "project_name": "3D Residual Learning for Appendicitis Diagnosis from Abdomen CT Scans",
      "summary": "We present a deep learning model for the diagnosis of appendicitis from abdomen CT scans.",
      "team_members": "Michael Bereket"
    },
    {
      "class": "CS191",
      "description": "Currently, the HealthRex codebase has no modules to handle data processing and analytics on sequential-event data. For a past project, I wrote a script to analyze Stanford Hospital data and determine the probability of a lab result being normal given the number of times the result was normal in the past. I abstracted a general-purpose, sequential-event analysis pipeline from my existing code so that future researchers in the HealthRex lab can easily analyze and generate useful statistics from any time series data. Using the pipeline, users can select a window of events according to any criteria they choose, and can then compute arbitrary statistics on such windows/events.",
      "placement": "Health & Biomedical",
      "project_name": "Making Medical Time Series Data Analysis Easy",
      "summary": "Sequential time-series data analysis in medical research settings is often complicated and time-intensive. As part of Dr. Jonathan Chen's lab (HealthRex), I built an easily-customizable pipeline for analyzing such data to enable more research in the area.",
      "team_members": "Shivaal K Roy"
    },
    {
      "class": "CS191",
      "description": "Generative Adversarial Networks (GANs) represent an attractive and novel approach to generate realistic data, such as genes, proteins, or drugs, in synthetic biology. Here, we apply GANs to generate synthetic DNA sequences encoding for proteins of variable length. We propose a novel feedback-loop architecture, called Feedback GAN (FBGAN), to optimize the synthetic gene sequences for desired properties using an external function analyzer. The proposed architecture also has the advantage that the analyzer need not be differentiable. We apply the feedback-loop mechanism to two examples: 1) generating synthetic genes coding for antimicrobial peptides, and 2) optimizing synthetic genes for the secondary structure of their resulting peptides. A suite of metrics demonstrate that the GAN generated proteins have desirable biophysical properties. The FBGAN architecture can also be used to optimize GAN-generated datapoints for useful properties in domains beyond genomics.",
      "placement": "Health & Biomedical",
      "project_name": "PromoterGAN: Generative Adversarial Networks for Synthesizing Noncoding DNA",
      "summary": "Generative Adversarial Networks (GANs) to design novel DNA sequences and optimize them for user-desired gene expression, for personalized medicine and synthetic biology applications.",
      "team_members": "Anvita Gupta"
    },
    {
      "class": "CS191",
      "description": "The mechanics behind many human diseases can be traced back to groups of interacting proteins in our cells. This fact has inspired a huge effort to document the network of human protein interactions. In this project, we develop a new algorithm that mines that network of protein interactions to discover proteins likely to be implicated in a disease. Our algorithm significantly outperforms previous network-based methods of disease protein discovery. We also analyze the structure of disease pathways in the protein-protein interaction network.",
      "placement": "Health & Biomedical",
      "project_name": "Disease Protein Prediction in the Human Interactome",
      "summary": "New network-based methods for the discovery of proteins implicated in human diseases",
      "team_members": "Evan Sabri Eyuboglu"
    },
    {
      "class": "CS191W",
      "description": "Several linguists have identified qualities associated with “women’s language,” and natural language processing research has studied gender in writing broadly.  However, few studies have used computational tools to look at gender-separated dialogue in literature.  Given the significance of gender and gender stereotypes in STEM fields, this project aims to quantify women’s language in science fiction.  Specifically, I use Linguistic Inquiry and Word Count (LIWC) categories to analyze quotations in a corpus of short science fiction stories written between 1920 and 1965.",
      "placement": "ML & NLP & CV",
      "project_name": "LIWC and Leia: An analysis of gender and quotations in short science fiction",
      "summary": "A research project that analyzes quotations and gender in short science fiction using Linguistic Inquiry and Word Count (LIWC)",
      "team_members": "Kylie Jue"
    },
    {
      "class": "CS399",
      "description": "Presenting 2 separate projects: \n1) RedditCabal is a twitch stream where you can vote live on new posts to Reddit. Browsing new posts on Reddit can often be a boring experience, but the people who browse new posts are the ones who decide what makes it to the front page. RedditCabal makes dredging through new posts into a social experience.   \n2) Gerry is a mobile puzzle game where you gerrymander districts to win them for your party. It uses a minimalist 3-D puzzle block aesthetic and simple controls.",
      "placement": "Music & Social",
      "project_name": "Gerry + RedditCabal",
      "summary": "Presenting 2 separate projects: \n1) RedditCabal is a twitch stream where you can vote live on new posts to Reddit. \n2) Gerry is a mobile puzzle game where you gerrymander districts to win them for your party.",
      "team_members": "Dennis Woncheol Jeong"
    }
  ]
}